{
    "took": 2,
    "timed_out": false,
    "_shards": {
      "total": 1,
      "successful": 1,
      "skipped": 0,
      "failed": 0
    },
    "hits": {
      "total": {
        "value": 548,
        "relation": "eq"
      },
      "max_score": 2.132642,
      "hits": [
        {
          "_index": "mathematicians",
          "_id": "vFymJYIB-iFoJ7CDAI3N",
          "_score": 2.132642,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Abu_Kamil_Shuja_ibn_Aslam_ibn_Muhammad_ibn_Shuja",
            "biography": """
  
  
  Abu Kamil Shuja ibn Aslam ibn Muhammad ibn Shuja
  
  
  
  
  
  Quick Info
  Born
  
        about 850
        
        
          
          (possibly) Egypt
          
        
      
  Died
  
        about 930
        
        
      
  
  Summary
  Abu Kamil Shuja was an Islamic mathematician. He was one of Al-Khwarismi's successors and applied algebraic methods to geometric problems.
  
  
  
  
  
  Biography
  Abu Kamil Shuja is sometimes known as al-Hasib al-Misri, meaning the calculator from Egypt. Very little is known about Abu Kamil's life - perhaps even this is an exaggeration and it would be more honest to say that we have no biographical details at all except that he came from Egypt and we know his dates with a fair degree of certainty.
  
  
  The Fihrist (Index) was a work compiled by the bookseller Ibn an-Nadim around 988. It gives a full account of the Arabic literature which was available in the 10th  century and it describes briefly some of the authors of this literature. The Fihrist includes a reference to Abu Kamil and among his works listed there are: (i) Book of fortune, (ii) Book of the key to fortune, (iii) Book on algebra, (vi) Book on surveying and geometry, (v) Book of the adequate, (vi) Book on omens, (vii) Book of the kernel, (viii) Book of the two errors, and (ix) Book on augmentation and diminution. Works by Abu Kamil which have survived, and will be discussed below, include Book on algebra, Book of rare things in the art of calculation, and Book on surveying and geometry.
  
  
  Although we know nothing of Abu Kamil's life we do understand something of the role he plays in the development of algebra. Before al-Khwarizmi we have no information of how algebra developed in Arabic countries, but relatively recent work by a number of historians of mathematics as given a reasonable picture of how the subject developed after al-Khwarizmi. The role of Abu Kamil is important here as he was one of al-Khwarizmi's immediate successors. In fact Abu Kamil himself stresses al-Khwarizmi's role as the "inventor of algebra". He described al-Khwarizmi as (see for example [4] or [5]):-
  ... the one who was first to succeed in a book of algebra and who pioneered and invented all the principles in it.
  Again Abu Kamil wrote:-
  I have established, in my second book, proof of the authority and precedent in algebra of Muhammad ibn Musa al-Khwarizmi, and I have answered that impetuous man Ibn Barza on his attribution to Abd al-Hamid, whom he said was his grandfather.
  There is certainly no doubt that Abu Kamil considered that he was building on the foundations of algebra as set up by al-Khwarizmi and indeed he forms an important link in the development of algebra between al-Khwarizmi and al-Karaji. There is another reason for Abu Kamil's importance, however, which is that his work was the basis of Fibonacci's books. So not only is Abu Kamil important in the development of Arabic algebra, but, through Fibonacci, he is also of fundamental importance in the introduction of algebra into Europe. The author of [12] presents a list of parallels between Abu Kamil's works on algebra and the works of Fibonacci, and he also discusses the influence of Abu Kamil on two algebra texts of al-Karaji.
  
  
  The Book on algebra by Abu Kamil is in three parts: (i) On the solution of quadratic equations, (ii) On applications of algebra to the regular pentagon and decagon, and (iii) On Diophantine equations and problems of recreational mathematics. The part on the regular pentagon and decagon is studied in detail in [7], while the remainder of the work is described in [10]. The content of the work is the application of algebra to geometrical problems. It is the combination of the geometric methods developed by the Greeks together with the practical methods developed by al-Khwarizmi mixed with Babylonian methods.
  
  
  An important step forward in Abu Kamil's algebra is his ability to work with higher powers of the unknown than x2x^{2}x2. These powers are not given in symbols but are written in words, yet the naming of the powers tell us that Abu Kamil had begun to understand what we would write in symbols as xnxm=xn+mx^{n}x^{m} = x^{n+m}xnxm=xn+m. For example he uses the expression "square square root" for x5x^{5}x5 (i.e. x2×x2×xx^{2} \times  x^{2} \times  xx2×x2×x), "cube cube" for x6x^{6}x6 (i.e. x3×x3x^{3} \times  x^{3}x3×x3), "square square square square" for x8x^{8}x8 (i.e. x2×x2×x2×x2x^{2} \times  x^{2} \times  x^{2} \times  x^{2}x2×x2×x2×x2). In fact Abu Kamil works easily with the powers up to x8x^{8}x8 which appear in the text. The algebra contains 69 problems which include many of the 40 problems considered by al-Khwarizmi, but with a rather different approach to them.
  
  
  The Book on surveying and geometry is studied in detail in [9]. It was written by Abu Kamil, not for mathematicians, but rather for government land surveyors. Because of the people that it was aimed at, the work contains no proofs. Rather it presents a number of rules, some of which are far from easy, each given for the numerical solution of a geometric problem. Each rule is illustrated with a worked numerical example. Mainly the rules are for calculating the area, perimeter, diagonals etc. of figures such as squares, rectangles, and various different types of triangle. Abu Kamil also gives rules to calculate the volume and surface area of various solids such as rectangular parallelepipeds, right circular prisms, square pyramids, and circular cones.
  
  
  The work also deals with circles and here Abu Kamil takes π=227\pi = \large\frac{22}{7}\normalsizeπ=722​. A whole section is devoted to calculating the area of the segment of a circle. The final part of the work gives rules for calculating the side of regular polygons of 3, 4, 5, 6, 8, and 10 sides either inscribed in, or circumscribed about, a circle of given diameter. For the pentagon and decagon the rules which Abu Kamil gives, although without proof in this work, were fully proved in his algebra book.
  
  
  The Book of rare things in the art of calculation is concerned with solutions to indeterminate equations. Sesiano in [11] discusses Abu Kamil's work on indeterminate equations and he argues that his methods are very interesting for three reasons. Firstly Abu Kamil is the first Arabic mathematician whom we know solved indeterminate problems of the type found in Diophantus's work. Secondly, as far as we know, Abu Kamil wrote before Diophantus's Arithmetica had been studied in depth by the Arabs. Thirdly, Abu Kamil explains certain methods which are not found in the known books of the Arithmetica.
  
  
  
  
  
  
  
  Other Mathematicians born in Egypt
  
  
  
  
  
  References (show)
  
  
  
  
  
  M Levey, Biography in Dictionary of Scientific Biography (New York 1970-1990).
  
  See THIS LINK.
  W Hartner, Abu Kamil Shuja, Encylopedia of Islam (Leiden, 1960).
  M Levey, The 'Algebra' of Abu Kamil (Madison, 1966).
  R Rashed, The development of Arabic mathematics : between arithmetic and algebra (London, 1994).
  R Rashed, Entre arithmétique et algèbre: Recherches sur l'histoire des mathématiques arabes (Paris, 1984).
  M Levey, Some notes on the algebra of Abu Kamil Shuja, a fusion of Babylonian and Greek algebra, Enseignement Math. (2) 4 (1958), 77-92.
  R Lorch, Abu Kamil on the pentagon and decagon, Vestigia mathematica (1993), 215-252.
  P Schub and M Levey, Indeterminate problems of Abu Kamil (850-930), Atti Accad. Naz. Lincei Mem. Cl. Sci. Fis. Mat. Natur. Sez. Ia (8) 10 (2) (1970), 23-96.
  J Sesiano, Le Kitab al-Misaha d'Abu Kamil, Centaurus 38 (1996), 1-21.
  J Sesiano, La version latine médiévale de 'l'Algèbre' d'Abu Kamil, in Vestigia mathematica (Amsterdam, 1993), 315-452.
  J Sesiano, Les méthodes d'analyse indéterminée chez abu Kamil, Centaurus 21 (2) (1977), 89-105.
  S Shalhub, The calculations and algebra of abu Kamil Shuja ibn Aslam and his effects on the work of al-Karaji and on the work of Leonardo Fibonacci (Arabic), in Deuxième Colloque Maghrebin sur l'Histoire des Mathématiques Arabes (Tunis, 1990), A23-A39.
  M Yadegari, The use of mathematical induction by Abu Kamil Shuja ibn Aslam (850-930), Isis 69 (247) (1978), 259-262.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other pages about Abu Kamil Shuja:
  
  See Abu Kamil Shuja on a timeline
  
  
  
  Other websites about Abu Kamil Shuja:
  
  Dictionary of Scientific Biography
  Google books
  MathSciNet Author profile
  
  
  
  
  
  
  Cross-references (show)
  
  
  
  
  
  History Topics: Arabic mathematics : forgotten brilliance?
  History Topics: The Golden ratio
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update November 1999
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "nlymJYIB-iFoJ7CDD4_c",
          "_score": 2.1250587,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "George_Peacock",
            "biography": """
  
  
  George Peacock
  
  
  
  
  
  Quick Info
  Born
  
        9 April 1791
        
  
          Thornton Hall, Denton, County Durham, England
          
  
  Died
  
        8 November 1858
        
        Pall Mall, London, England
      
  
  Summary
  George Peacock published his Treatise on Algebra  which attempted to give algebra a logical treatment comparable to Euclid's Elements .
  
  
  
  
  
      View four larger pictures
  
  
  
  
  
  Biography
  George Peacock's father was the Rev Thomas Peacock, a Church of England priest who was for 50 years the perpetual curate at Denton, near Darlington, County Durham, where he also ran a local school. Thomas Peacock married Ann Hodgson, the daughter of John Hodgson of Denton and his wife Ann, on 9 November 1781. They had several children but Ann Peacock died young and Thomas Peacock remarried on 2 May 1789. His second wife, Jane Thompson, was the mother of his fifth son, George, the subject of this biography. His final child, and third daughter, Hannah Mary Anne Peacock was born to Thomas and Jane Peacock on 12 February 1798. The year that George Peacock was born, 1791, and the year 1798 that his eighth and final child Hannah were born were the years in which Thomas Peacock published mathematics books. These were The tutor's assistant modernised (1791) and The Practical Measurer (1798). The full titles of these books are:
  The tutor's assistant modernised
  
  or: A regular system of practical arithmetic: comprising of all the modern improvements in that art, that are necessary for the man of business and the practical scholar.
  and
  The Practical Measurer
  
  containing the Uses of Logarithms, Gunter's Scale, the Carpenter's Rule, and the Sliding Rules: the best and most approved Modes of drawing Geometrical Figures: the Doctrine of Plane Trigonometry and its Application to Heights and Distances: the Mensuration of Superficies, Solids, and Artificers' Works; and the Methods of Surveying, Planning, and Dividing Land.
  We give the Preface to The tutor's assistant modernised at THIS LINK.
  
  
  George was educated at home by his father and, because of his father's mathematical interests, it is clear that George must have received a good grounding in mathematics from a skilled teacher. Then he attended Sedbergh School until he was 17 years old when, in 1808, he entered Richmond School, Yorkshire (Richmond is one of the nearest towns to Denton) to prepare for entering the University of Cambridge. The master of Richmond School was James Tate, a former fellow of Sidney Sussex College, Cambridge, who had a excellent reputation in training boys for Cambridge. Only elementary mathematics was necessary for entry to Cambridge so, although he knew more advanced material, George excelled in the elementary topics taught at Richmond. He also distinguished himself in classics where the much more advanced level allowed him to show his great potential. Peacock completed his schooling in 1809, being ranked as the top student. He was admitted as a sizar at Trinity College, Cambridge, on 21 February 1809. He was coached during the summer by John Brass, an undergraduate at Trinity College, Cambridge, who was taking the Mathematical Tripos. In the autumn of 1809 Peacock matriculated as a student at Trinity College, Cambridge.
  
  
  As an undergraduate at Cambridge he made friends with John Herschel and Charles Babbage. In fact it was through a common friend, Edward Bromhead, that they first met on 7 May 1811. Bromhead [29]:-
  ... invited a small group to meet in his rooms to discuss the possible formation of a society whose aim would be to encourage the study of analytical methods in Cambridge. It was then that Babbage, Herschel and Peacock first met each other. Feeling at the meeting was favourable to the formation of a society and the formal inaugural meeting of the Analytical Society took place very shortly afterwards. ... Bromhead played no subsequent role of any importance in the Cambridge reform movement ... It is clear that Cambridge needed the Analytical Society to bring together the young reformers. Its formation sparked off feverish activity among the leaders.
  We note that there is some argument between historians over the date the Analytic Society was formed. Babbage claimed it was in 1812, but the general view is that he misremembered the year and in fact it was 1811. In 1812 Peacock graduated, placed second to John Herschel in the Mathematical Tripos examinations. He also won the second Smith's prize. In 1814 Peacock was awarded a fellowship to Trinity and, in the following year, he became a tutor and lecturer in Trinity College.
  
  
  In 1816 the Analytical Society produced a translation of Sylvestre Lacroix's Traité élémentaire de calcul differéntiel et du calcul intégral (1802) which was written in the Continental style for the differential and integral calculus. The English translation appeared under the title An Elementary Treatise on the Differential and Integral Calculus (1816) and contained over 100 pages of added notes by Peacock and Herschel. Babbage, Herschel and Peacock began to work on this translation when the Analytic Society was formed, so it is reasonable to ask why it took so long for the translation to appear. The reason for the delay seems to have been due to Peacock who, although a keen supporter of the dydx\large\frac{dy}{dx}\normalsizedxdy​ notation, found other aspects of Lacroix's book not to his liking. Babbage, Herschel and Peacock certainly, although agreeing a common aim with the Analytical Society, nevertheless had rather different views on mathematics itself and how it should be taught. Only after the addition of the copious notes was Peacock happy to publish the book. The following year, 1817, Peacock was moderator of the Mathematical tripos examinations at Cambridge and used his position to further his reforms setting examinations using Leibniz's calculus notation. William Whewell wrote to Herschel in March 1817 (see [29]):-
  You have I suppose seen Peacock's examination papers. They have made a considerable outcry here and I have not much hope that he will be moderator again. I do not think he took precisely the right way to introduce the true faith. He has stripped his analysis of its applications and turned it naked among them. Of course all the prudery of the University is up and shocked at the indecency of the spectacle. The cry is 'not enough philosophy'. Now the way to prevent such a clamour would have been to have given good, intelligible, but difficult physical problems, things which people would see that they could not do their own way and which would excite their curiosity sufficiently to make them thank you for your way of doing them.
  Peacock responded to criticism that he received, writing to one of his friends saying (see [21], or [23]):-
  I assure you that I shall never cease to exert myself to the utmost in the cause of reform, and that I will never decline any office which may increase my power to effect it. I am nearly certain of being nominated to the office of Moderator in the year 1818-19, and as I am an examiner in virtue of my office, for the next year I shall pursue a course even more decided than hitherto, since I shall feel that men have been prepared for the change, and will then be enabled to have acquired a better system by the publication of improved elementary books. I have considerable influence as a lecturer, and I will not neglect it. It is by silent perseverance only, that we can hope to reduce the many-headed monster of prejudice and make the University answer her character as the loving mother of good learning and science.
  We note that he was moderator of the tripos again, namely in 1819 and in 1821. He was influenced, however, by a visit of Jean-Baptiste Biot to Cambridge in 1818. Biot argued that French mathematicians had neglected the applications of the calculus that Isaac Newton had introduced. In the 1819 examinations Peacock again used Leibniz's notation, but this time with a considerable amount of applied mathematics, and thereafter it became standard practice. Peacock published Collection of Examples of the Application of the Differential and Integral Calculus in 1820, a publication which sold well and helped further the aims of the Analytical Society. In some ways this was intended to answer some of the criticisms for the Continental approach to calculus which was entirely theoretical while the Cambridge approach was based on using the calculus to solve problems. With this book of problems solved using the Continental style of calculus, Peacock was making the Continental approach more palatable at Cambridge. However, a book published in 1820 continued the attack on Peacock's reforms (see [29]):-
  Academic education should be strictly confined to subjects of real utility and as far as the lucubrations of French analysts have no immediate bearing on philosophy, they are as unfit subjects of academic examination as the Aristotelian jargon of the old schools ... nor is it right or reasonable that young men should be obliged to read them in order to attain the honours of the Senate House.
  Babbage had produced a number of manuscripts which were unpublished but he had discussed them with Peacock. These manuscripts, as now held in the British Museum, are: (1) On Notation; (2) Of the influence of general signs in analytical reasonings, (3) General notions respecting Analysis (my theory of identity); (4) Induction; (5) Generalisation; (6) Analogy; (7) Of the law of Continuity; (8) Of the value of a first book; (9) Of Artifices; (10) Of problems requiring new methods where the difficulty generally consists in putting it into Analytical language. It is unclear whether Peacock refers to the same ordering as now exists, but here is an extract from a letter he wrote to Babbage on 7 May 1822:-
  I shall send your essays tomorrow morning by coach. I have read the greater part of them over very attentively, a task which you will readily acknowledge as of some difficulty considering the manner in which they are written; in some cases I have been completely baffled in my attempt particularly in the latter part of the first essay and in the greatest part of the second. I have, before expressed my opinion concerning them; they must form when completed a work of very great interest, abounding as they do with so much of original research and with illustrations of the most interesting kind; the essay on artifices and on questions requiring new methods of Analysis will be charming when completed
  In [12] Dubbey argues that Peacock's famous Treatise on Algebra, which he published in 1830, contains ideas remarkably similar to those in Babbage's third paper. In [5] Becher suggests that these ideas go back even further, pointing to the work of Robert Woodhouse at Cambridge. However, Menachem Fisch presents a rather different suggestion in [15] regarding Peacock's approach to algebra which has much merit. But before looking at Fisch's ideas, we must look at the Treatise on Algebra.
  
  
  Peacock's ideas are expressed in a long Preface to the book and we have given an extract from the Preface at THIS LINK.
  
  
  In Treatise on Algebra, Peacock attempted to give algebra a logical treatment comparable to Euclid's Elements. First he looks at what "algebra" is:-
  'Algebra' may be defined to be, the science of general reasoning by symbolical language. . . . it has been termed Universal Arithmetic: but this definition is defective, in as much as it assigns for the general object of the science, what can only be considered as one of its applications.
  Peacock describes in detail in the Preface (see THIS LINK) how algebraic symbols have, up to that time, been thought merely to stand for numbers. He points to the difficulties in this approach and his purpose in the book is to make algebra a much more general science. He has two types of algebra, arithmetical algebra and symbolic algebra. In the book he describes symbolic algebra as:-
  ... the science which treats the combinations of arbitrary signs and symbols by means defined through arbitrary laws.
  He also wrote:-
  We may assume any laws for the combination and incorporation of such symbols, so long as our assumptions are independent, and therefore not inconsistent with each other.
  Dubbey summarises the main thesis of Peacock's ideas in the book [12]:-
  (1) Algebra had previously been considered only as a modification of Arithmetic. 
  
  (2) Algebra consists of the manipulation of symbols in a way independent of any particular interpretation. 
  
  (3) Arithmetic is only a special case of Algebra - a "Science of Suggestion" as Peacock put it. 
  
  (4) The sign "=" is to be taken as meaning "is algebraically equivalent to". 
  
  (5) The principle of the permanence of equivalent forms.
  This fifth principle allowed Peacock to extend the rules of arithmetic using what he called the principle of the permanence of equivalent forms to give his symbolic algebra. He was not as bold in practice, therefore, as the abstract ideas for symbolic algebra which he gives in theory. He investigated the basic properties of numbers, such as the distributive property, that underlie the subject of algebra. This property allowed Peacock to 'prove' that (-1)(-1) = 1, and it would appear that his attempt is more convincing that earlier attempts, for instance by Euler. Peacock's proof, which is in the second edition of the book, published in 1845, goes as follows:
  (a−b)(c−d)=ac+bd−ad−bc(a - b)(c - d) = ac + bd - ad - bc(a−b)(c−d)=ac+bd−ad−bc holds for arithmetic when a>ba > ba>b and c>dc > dc>d. By the principle of permanence, this holds in symbolic algebra. Put a=0,c=0,b=1a = 0, c = 0, b = 1a=0,c=0,b=1, and d=1d = 1d=1 to get (-1)(-1) = 1.
  We now give Menachem Fisch's comparison of the two approaches of Babbage and Peacock [15]:-
  Babbage's essays were not written with a view to making sense of algebra as he found it. They do not represent an interpretive or explanatory undertaking, at least not primarily so. They are an attempt, or rather an outline of an attempt, to explore the foundations, reformulate the objectives, and lay down the foundational principles of a new, and austere conception of mathematical analysis. It was the undertaking of a working mathematician; not a 'study' of mathematics, but a 'work' of mathematics. In this respect Peacock's algebraic project was very different. ... the 'Treatise' was essentially a comment 'on' algebra, a critique performed with a view to articulating what algebra was, and analyzing what it could therefore achieve. In order to understand it, Peacock's work aspired to dismantle (to deconstruct) an existing area of mathematics.
  In 1831 the British Association for the Advancement of Science was set up. One of its first aims was to obtain reports on the state and progress of various sciences from leaders in their fields. Hamilton was asked to prepare a report on mathematics but he declined. Peacock was then asked and he accepted although he restricted his report to Algebra, Trigonometry and the Arithmetic of Sines. He read his report at the 1833 meeting of the Association in Cambridge and the report was subsequently printed. Remarkably, in 1940, about 100 years after Peacock first published his Treatise on Algebra, the book was reprinted in two volumes. See THIS LINK for extracts from two reviews of the 1940 edition.
  
  
  We should fill in some details of Peacock's career which we have passed over in looking at his algebra. He was ordained a deacon in 1819 and, on 22 September 1822, he was ordained a priest at Norwich. He served as Vicar of Wymewold from 1826 to 1835. In 1836 he was appointed Lowndean professor of astronomy and geometry at Cambridge and three years later was appointed dean of Ely cathedral, spending the last 20 years of his life there [6]:-
  As dean of Ely, Peacock threw himself into the restoration of Ely Cathedral, both in directing the restoration and in raising funds. He was a prolocutor of the lower house of the convocation of Canterbury from 1841 to 1847 and from 1852 until 1857, when failing health prompted his resignation. He also brought about improvements in the city of Ely's drainage system and fostered the education of the middle and lower classes. In addition to his other ecclesiastical appointments, from 1847 onwards he was rector of Wentworth, near Ely.
  Peacock published Observations on the Statutes of the University of Cambridge (1841) and The life of Thomas Young (1855). He also edited the first two volumes of Miscellaneous works of the Late Thomas Young (1855). Andrew Robinson writes about Peacock as Thomas Young's biographer in [4]:-
  Peacock was repeatedly requested to write the life by Mrs Young and was reluctant to agree, given his heavy professional commitments, illness and the daunting nature of the subject. He had access to Young's journals and private papers and the many frank letters Young wrote to Hudson Gurney - almost all of which have since disappeared ... Peacock's book is therefore invaluable for quoting at length from now vanished original sources. On the other hand, Peacock is a prolix Victorian writer whose attempt to describe Young's scientific ideas entirely in words, without a single diagram ... quickly become self-defeating.
  In 1847, at the age of 56, Peacock married Frances Elizabeth Selwyn. She was the second daughter of the Queen's Council William Selwyn, who was a graduate of Trinity College, Cambridge. George and Frances Peacock did not have children. It was about the time of his marriage that his health began to deteriorate. Peacock does not seem to have had much respect for the doctors whom he consulted. He writes (see [4]):-
  It is the peculiar misfortune of the medical profession that its members can rarely dare to confess their ignorance, thinking it more or less necessary - in order to maintain their influence with their patients and with the world - to speak with equal decision, whether they are authorised by their knowledge to do so or not ... The real fact is that the prestige of a reputation once attained, whether through the influence of charlatanism, good fortune, or superior merit, is not easily destroyed, and the very eccentricities and extravagances which repel patients of sense and delicacy, tend to confirm the prepossessions of those who are wanting in these qualities, and who are naturally apt to wonder at or admire what they do not understand.
  Among the honors that Peacock received, we note that he was elected to the Royal Society of London in January 1818, and he joined the Royal Astronomical Society in 1820, the year it was founded. Although Peacock was not at the founding meeting, he had discussed the founding of the Society with Babbage and Herschel about ten days before that meeting. Herschel records in his diary:-
  Saturday, 1 January 1820: - Dined with Peacock and Babbage at Provost Goodall's at Eton, and met Col. Thackeray, Vice-Provost Roberts, Capt. Roberts, etc,
  
  Sunday 2 January 1820: - Peacock and Babbage left Slough after spending a few days here.
  Peacock was a reformer for his whole life. He worked hard to reform the statutes of Cambridge University and, when the Government set up a Commission to propose reforms, he was appointed to it. Although he attended meetings of the Commission, he died before the report was finished. Although he died at 16 Suffolk Street, Pall Mall, London, he was buried in Ely cemetery. We note that his widow, Frances Peacock, married W H Thompson in 1866. Thompson had been one of Peacock's students at Trinity College.
  
  
  
  
  
  
  
  Other Mathematicians born in England
  
  A Poster of George Peacock
  
  
  
  
  
  References (show)
  
  
  
  
  
  E Koppelmann, Biography in Dictionary of Scientific Biography (New York 1970-1990). See THIS LINK.
  D Clock, A new British concept of algebra: 1825-1850 (PhD Thesis, University of Wisconsin, 1964).
  A D D Craik, Mr Hopkins' Men: Cambridge Reform and British Mathematics in the 19th Century (Cambridge University Press, Cambridge, 2007).
  A Robinson, The last man who knew everything (Pi Press, New York, 2005).
  H W Becher, Woodhouse, Babbage, Peacock, and modern algebra, Historia Math. 7 (4) (1980), 389-400.
  H W Becher, Peacock, George (1791-1858), Oxford Dictionary of National Biography (Oxford University Press, Oxford, 2004). See THIS LINK.
  H W Becher, Radicals, whigs and conservatives: the middle and lower classes in the analytical revolution at Cambridge in the age of aristocracy, British Journal for the History of Science 28 (1995), 405-426.
  H W Becher, Voluntary science in nineteenth century Cambridge University to the 1850's, British Journal for the History of Science 19 (1986), 57-87.
  H W Becher, Woodhouse, Babbage, Peacock and modern algebra, Historia Math. 7 (1980), 389-400.
  M M Beenken, Review: A Treatise on Algebra. Vol. I. Arithmetical Algebra, by George Peacock; A Treatise on Algebra. Vol. II. On Symbolical Algebra and Its Applications to the Geometry of Position, by George Peacock, National Mathematics Magazine 16 (5) (1942), 269-270.
  A De Morgan, Review: A Treatise on Algebra, by George Peacock, Quarterly Journal of Education 9 (1835), 293-311.
  J M Dubbey, Babbage, Peacock and modern algebra, Historia Math. 4 (3) (1977), 295-302.
  J M Dubbey, The Introduction of the Differential Notation to Great Britain, Annals of Science 19 (1963), 35-48.
  M-J Durand-Richard, Peacock's Arithmetic: an attempt to reconcile empiricism to universality, Indian J. Hist. Sci. 46 (2) (2011), 251-311.
  M Fisch, The making of Peacock's treatise on algebra: a case of creative indecision, Arch. Hist. Exact Sci. 54 (2) (1999), 137-179.
  M Fisch, The Emergency which has Arrives': The Problematic History of Nineteenth-Century British Algebra: A Programmatic Outline. British Journal For the History of Science 27 (1994), 247-276.
  L C Karpinski, Review: A Treatise on Algebra, by George Peacock, Amer. Math. Monthly 49 (4) (1942), 254-255.
  A Keller, George Peacock's Arithmetic in the changing landscape of the history of mathematics in India, Indian J. Hist. Sci. 46 (2011), 205-233.
  K Lambert, A natural history of mathematics: George Peacock and the making of English algebra, Isis 104 (2) (2013), 278-302.
  Y W Li and Y J Jin, A permanence principle for equivalent forms: George Peacock's symbolical algebra (Chinese), J. Northwest Univ. 38 (1) (2008), 157-160.
  A Macfarlane, George Peacock, (1791-1858), in A Macfarlane, Lectures on Ten British Mathematicians of the Nineteenth Century (New York, 1916), 7-18. http://www.gutenberg.net/etext06/tbmms10p.pdf
  M Panteki, William Wallace and the introduction of continental calculus to Britain: a letter to George Peacock, Historia Math. 14 (2) (1987), 119-132.
  H M Pycior, George Peacock and the British origins of symbolical algebra, Historia Math. 8 (1) (1981), 23-45.
  H M Pycior, Early Criticism of the Symbolic Approach to Algebra, Historia Mathematica (1982), 392-412.
  H M Pycior, Internalism, Externalism and Beyond: 19th Century British Algebra, Historia Mathematica 11 (1984), 424-441.
  D Raina, Situating the history of Indian arithmetical knowledge in George Peacock's 'Arithmetic', Indian J. Hist. Sci. 46 (2011), 235-250.
  J Richards, The art and science of British algebra: a study in the perception of mathematical truth, Historia Mathematica 7 (1980), 342-365.
  J Richards,  Rigor and Clarity: Foundations of Mathematics in France and England, 1800-1840, Science in Context 4 (1991), 297-319.
  M V Wilkes, Herschel, Peacock, Babbage and the development of the Cambridge curriculum, Notes and Records of the Royal Society of London 44 (2) (1990), 205-219.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other pages about George Peacock:
  
  Preface to Thomas Peacock's Tutor's Assistant
  Preface to George Peacock's Treatise on Algebra
  Reviews of the 1940 edition of Peacock's Algebra
  Multiple entries in The Mathematical Gazetteer of the British Isles,
  
  
  
  Other websites about George Peacock:
  
  Dictionary of Scientific Biography
  Dictionary of National Biography
  NNDB
  Mathematical Genealogy Project
  zbMATH entry
  ERAM Jahrbuch entry
  
  
  
  
  
  
  Honours (show)
  
  
  
  
  Honours awarded to George Peacock
  
  Lowndean chair 1837 - 1859
  
  
  
  
  
  
  Cross-references (show)
  
  
  
  
  
  Other: Earliest Known Uses of Some of the Words of Mathematics (D)
  Other: Earliest Known Uses of Some of the Words of Mathematics (G)
  Other: Earliest Known Uses of Some of the Words of Mathematics (L)
  Other: Earliest Known Uses of Some of the Words of Mathematics (M)
  Other: Earliest Known Uses of Some of the Words of Mathematics (P)
  Other: Earliest Known Uses of Some of the Words of Mathematics (S)
  Other: Earliest Known Uses of Some of the Words of Mathematics (T)
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update January 2015
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "z1ymJYIB-iFoJ7CDCY4-",
          "_score": 2.1028883,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Dmitrii_Konstantinovich_Faddeev",
            "biography": """
  
  
  Dmitrii Konstantinovich Faddeev
  
  
  
  
  
  Quick Info
  Born
  
        30 June 1907
        
  
          Yukhnov, Smolensk, now Kaluga, Russia
          
  
  Died
  
        30 October 1989
        
        Leningrad, USSR (now St Petersburg, Russia)
      
  
  Summary
  Dmitrii Faddeev was a Russian mathematician who worked mainly in algebra, and who made significant contributions to other areas such as number theory, function theory, geometry and probability.
  
  
  
  
  
      View five larger pictures
  
  
  
  
  
  Biography
  Dmitrii Konstantinovich Faddeev's father, Konstantin Tikhonovich Faddeev, was an engineer and his mother, Lubov' Germanovna, was a doctor. Konstantin Tikhonovich's father had an estate in the small town of Yukhnov, about 200 km south west of Moscow, and it was on this estate that Dmitrii Konstantinovich was born. Dmitrii Konstantinovich inherited his scientific ability from his father, who had been taught and advised by Aleksei Nikolaevich Krylov at the Moscow Higher Technical School, while from his mother he inherited outstanding musical ability.
  
  
  It was in St Petersburg that Dmitrii Konstantinovich grew up, for it was there that his parents worked; Konstantin Tikhonovich worked at the famous Nevsky Metalworks, Mechanical and Shipbuilding Factory. In 1914 St Petersburg was renamed Petrograd and it was there that the Russian Revolution began in 1917. The city and its inhabitants suffered greatly through the Russian Civil War but when stability returned in 1923, Faddeev began his studies in mathematics at Petrograd State University while, at the same time, studying music at the famous Petrograd Conservatory on Theatre Square. Despite his extraordinary talent for the piano, by the time Faddeev reached his third year of study, he realized that he had to choose between mathematics and music. He left the Conservatory, by this time renamed the Leningrad Conservatory since the city had been renamed Leningrad in 1924, and concentrated fully on his mathematical studies. However, his love of music continued throughout his life and, the article written to celebrate his seventieth birthday records [4]:-
  ... he is a fine pianist, his playing of Schumann's piano music is unforgettable. His friends recall musical evenings where he and the late Vladimir Ivanovich Smirnov played beautifully many striking pieces of chamber music for four hands.
  At Leningrad State University (as Petrograd State University was renamed in 1924), Faddeev was taught, and was greatly influenced, by Ivan Matveevich Vinogradov and Boris Nikolaevich Delone. After completing work for his diploma, he graduated in 1928. However, this was a very difficult period in Russia, with independent thinkers persecuted and many academics in fear for their lives, and it was difficult for him to advance his career ([31] or [32]):-
  According to Faddeev's own words, it was difficult to find a professional job upon graduation and he had to work with various organizations, including the Weights and Measures Department, where he became addicted to smoking because of long breaks between instrumental observations. However, later his willpower helped him give up this unhealthy habit. Here is a curious detail: that period of time was characterized by a practically total deficit, including that of paper; hence, Faddeev had to write his long calculations on the underside of wallpaper.
  In 1930 Faddeev married the mathematics student Vera Nikolaevna Zamyatina (who has a biography in this archive under her married name Vera Nikolaevna Faddeeva). They had three children, one of whom was Ludwig Dmitrievich Faddeev (born 10 March 1934) who was educated in the Faculty of Physics at Leningrad State University and went on to become an outstanding mathematician and theoretical physicist producing ideas and results which are at the forefront of today's research.
  
  
  Leaving the Weights and Measures Department in 1930, Faddeev taught at various Leningrad schools and also for a time at the Polytechnic Institute and the Engineering Institute. He began teaching at Leningrad State University in 1933 and, in 1935, he submitted his doctoral dissertation (equivalent to the habilitation). From 1932, he also worked in the Mathematics Department at the Steklov Institute of Physics and Mathematics of the USSR Academy of Sciences; the Department was headed by Vinogradov. The Mathematics Department had been set up as an separate department of the Steklov Institute in 1932 and, two years later, it became a separate Institute, namely the Steklov Mathematical Institute. At this stage the Institute moved from Leningrad to Moscow but, despite this, Faddeev continued to undertake joint work with others at the Institute. In 1940 the Leningrad Department of the Steklov Institute of Mathematics was founded and Faddeev worked there from that time on.
  
  
  In 1937 Faddeev became a professor at Leningrad State University, taking on a more important leadership role since Delone had moved to Moscow. In September 1939, Russia, allied with Germany, invaded Poland from the east. This had little effect on life in Leningrad. However, in June 1941 the course of the war changed dramatically for those living in Russia since Germany invaded their country. By the following month Hitler had plans to take both Leningrad and Moscow. As the German armies rapidly advanced towards Leningrad, many people were evacuated from the city including Faddeev and his family. For the duration of the siege of Leningrad, Faddeev lived in Kazan, about 800 km due east of Moscow and considered safe from the German invasion. For a long time there was no opportunity to return to Leningrad which was only liberated from the siege in January 1944. Even after the siege was lifted, access to the devastated city was for a considerable time only possible with a special permit. Faddeev, and other academics, obtained such a permit and again Leningrad State University began to operate.
  
  
  Much of Faddeev's early work had been done in collaboration with Delone, particularly the highly significant results he obtained on Diophantine equations. In [9] an overview of his research is given:-
  Faddeev's mathematical legacy is unusually diverse. His primary area was algebra, but he made significant contributions to other areas such as number theory, function theory, geometry and probability. Faddeev had a profound influence on the formation and development of numerical methods in mathematics, and the book 'Numerical methods in linear algebra' which he wrote with V N Faddeeva, has been a reference source for several generations of specialists.
  Let us now look at a more detailed description of some of his work. In [2] his early results on Diophantine equations are described:-
  Faddeev's very first results in Diophantine equations were remarkable. He was able to extend significantly the class of equations of the third and fourth degree that admit a complete solution. When he was studying, for example, the equation x3+y3=Ax^{3} + y^{3} = Ax3+y3=A, Faddeev found estimates of the rank of the group of solutions that enabled him to solve the equation completely for all A ≤ 50. Until then it had been possible to prove only that there were non-trivial solutions for some A. For the equation x4+Ay4=±1x^{4} + Ay^{4} = ±1x4+Ay4=±1 he proved that there is at most one non-trivial solution; this corresponds to the basic unit of a certain purely imaginary field of algebraic numbers of the fourth degree and exists only when the basic unit is trinomial.
  In 1940 Faddeev, in collaboration with Delone, published (in Russian) the book Theory of Irrationalities of Third Degree. This work included the results on Diophantine equations described in the above quotation and a wealth of other material. James V Uspensky begins a review as follows:-
  The purpose of this outstanding monograph is to present all that is known at the present time about cubic irrationalities and such problems in number theory as are intimately connected with them. The book for the most part consists of the original investigations of its authors, and even that which has been contributed by other investigators is presented from a new and original point of view. Two features are very characteristic of the mode of presentation: on the one hand the extensive use of geometrical considerations as a background for the true understanding of complicated situations which otherwise would remain obscure, and on the other hand, the care shown by the authors in inventing effective methods of solution, illustrated by actual application to numerical examples and to the construction of valuable tables.
  Also early in his career, while collaborating with Delone, Faddeev studied Galois groups. In particular he was interested in the inverse problem of Galois theory, namely given a particular group, classify the extensions of a given field with that group as its Galois group. In 1990 Faddeev, in collaboration with V V Ishkhanov and B B Lure, he published the Russian book The embedding problem in Galois theory  which was translated into English and the translation published by the American Mathematical Society in 1997. Faddeev's work on Galois groups led him to the ideas of homological algebra independently of Samuel Eilenberg and Saunders Mac Lane. He introduced the idea of a cocycle and of relative homology (although he did not use either of these terms). He went on to apply his homology theory to investigate algebras over fields of algebraic functions. In joint work with Zenon Ivanovich Borevich (1922-1995), one of Faddeev's students, he began to examine integral representations of rings. Their joint work on this topic includes Integral representations of quadratic rings (1960), and Representations of orders with cyclic index (1965).
  
  
  In the above overview of Faddeev's contributions, there is reference to his highly significant work on computational mathematics. Much of this work was done in collaboration with his wife Vera Nikolaevna Faddeeva but his first few papers on this topic are single authored: On certain sequences of polynomials which are useful for the construction of iteration methods for solving of systems of linear algebraic equations (1958), On over-relaxation in the solution of a system of linear equations (1958), and On the conditionality of matrices (1959). MathSciNet lists around 20 joint publications by Faddeev and his wife on numerical analysis including their most famous, the book Computational methods of linear algebra which appeared in Russian in 1960. They were awarded a State Prize for this remarkable monograph. It was translated into English and published in 1963, the same year in which an enlarged and revised Russian version was published. Note that in 1975 the two authors produced another major work summarizing work done on numerical linear algebra during the years 1962-1974. Unfortunately the English translation of the 1960 monograph left much to be desired and most reviewers comment on the deficiencies of the translation more than on the contents. However, J C P Miller [23] does note that the Russian book is an exceptional work:-
  The original edition of this book in Russian is undoubtedly a very stimulating and valuable book, and translation into English is a very worthwhile task. The content of the book is comprehensive, with much material that does not appear to have been collected together previously.
  There were, however, many other aspects of Faddeev's mathematical contributions in addition to his research [9]:-
  In addition to a publication list of more than 160 titles, Faddeev's career was marked by his interest in education. He was known for his many students, his contributions to the structuring of contemporary mathematical education, his creation of internationally-known scientific schools, and his outstanding textbooks.
  He was one of the founders of the Mathematical Olympiads for school children and he put considerable effort into organizing these events. The first Mathematical Olympiad took place in Leningrad in 1934. He produced a series of 'Problem' books aimed at pupils in various different years at high school. He also published, with the collaboration of Iliya Samuilovich Sominskii, Problems in Higher Algebra. This book was very popular, going through many (at least eleven) editions following its first publication in 1951, and an English translation appeared in 1965. H M Cundy, in a review of the English translation, writes [7]:-
  This book consists of 983 problems (209 pages); hints to selected problems (37 pages), mostly the briefest possible; and 250 pages of solutions, ranging from mere answers to numerical problems to complete proofs ... The problems are grouped under seven heads: Complex Numbers, Determinants, Linear Equations, Matrices, Polynomials and Rational Functions of a single Indeterminate, Symmetric Functions, and Linear Algebra.
  D J Lewis writes [22]:-
  It is obvious that this book will be a valuable source of problems for any teacher or examiner. It could be a useful adjunct text in courses treating such topics.
  As well as these 'Problem' books, Faddeev produced textbooks such as Lectures on algebra. This is an undergraduate text based on his lectures at Leningrad University. He also wrote the school textbooks Elements of higher mathematics for school-children and Algebra 6-8. In the Preface to Lectures on algebra he explains his ideas about teaching abstract ideas:-
  I consider that abstract concepts must be introduced to the extent that their introduction succeeds in stimulating in the students the need to generalise or, at least, a realisation that it is possible to illustrate sufficiently general concepts by more concrete material.
  The contents of this book are: Integers; Complex numbers; Elements of the algebra of polynomials; Matrices and determinants; Quadratic forms; Polynomials and functions; Congruences in a ring of polynomials and field extensions; Polynomials with integer coefficients. Polynomials over factorial rings; Distribution of roots of a polynomial; Elements of group theory; Symmetric polynomials; Vector spaces; Euclidean space and unitary space; Elements of tensor algebra; and Algebras.
  
  
  Faddeev received many honours including the order of Lenin in 1967 and the order of the Red Banner of Labour which he received on three separate occasions, 1951, 1957, and 1975. In 1964 he was elected a Corresponding Member of the Mathematics Section of the USSR Academy of Sciences.
  
  
  
  
  
  Other Mathematicians born in Russia
  
  A Poster of Dmitrii Konstantinovich Faddeev
  
  
  
  
  
  References (show)
  
  
  
  
  
  A D Aleksandrov, M I Bashmakov, Z I Borevich, V N Kublanovskaya, M S Nikulin, A I Skopin and A V Yakovlev, Dmitrii Konstantinovich Faddeev (on the occasion of his eightieth birthday) (Russian), Uspekhi Mat. Nauk 44 (3)(267) (1989), 187-193.
  A D Aleksandrov, M I Bashmakov, Z I Borevich, V N Kublanovskaya, M S Nikulin, A I Skopin and A V Yakovlev, Dmitrii Konstantinovich Faddeev (on the occasion of his eightieth birthday), Russian Math. Surveys 44 (1989), no. 3, 223-231.
  P S Aleksandrov, M I Bashmakov, Z I Borevich, V N Kublanovskaja, A I Skopin, S L Sobolev and A V Jakovlev, Dmitrii Konstantinovich Faddeev (on the occasion of his seventieth birthday) (Russian), Uspekhi Mat. Nauk 34 (2)(206) (1979), 223-229.
  P S Aleksandrov, M I Bashmakov, Z I Borevich, V N Kublanovskaja, A I Skopin, S L Sobolev and A V Jakovlev, Dmitrii Konstantinovich Faddeev (on the occasion of his seventieth birthday), Russian Math. Surveys 34 (2) (1979), 253-260.
  Z I Borevich, S M Ermakov, A I Skopin and A V Yakovlev, Dmitrii Konstantinovich Faddeev (on the occasion of his 80th birthday) (Russian), Vestnik Leningrad. Univ. Mat. Mekh. Astronom. (1) (1988), 3-5.
  Z I Borevich, Yu V Linnik and A I Skopin, Dmitrii Konstantinovich Faddeev (on his sixtieth birthday), Russian Math. Surveys 23 (1968), 169-175.
  H M Cundy, Review: Problems in Higher Algebra by D K Faddeev and I S Sominskii, The Mathematical Gazette 50 (372) (1966), 203-204.
  Dmitrii Konstantinovich Faddeev (obituary) (Russian), Zh. Vychisl. Mat. i Mat. Fiz. 30 (7) (1990), 1116.
  Dmitrii Konstantinovich Faddeev: 1906-1989, Notices Amer. Math. Soc. 37 (6) (1990), 677-678.
  Dmitrii Konstantinovich Faddeev (Russian), Algebra i Analiz 1 (6) (1989), 244-245.
  Dmitrii Konstantinovich Faddeev, Leningrad Math. J. 1 (6) (1990), 1559-1560.
  A S Householder, Review: Computational Methods of Linear Algebra by D K Faddeev and V N Faddeeva, Mathematics of Computation 18 (87) (1964), 512-513.
  M K Kerimov, On the centenary of the birth of Dimitrii Konstantinovich Faddeev, Corresponding Member of the Academy of Sciences of the USSR (1907-1989) (Russian), Zh. Vychisl. Mat. Mat. Fiz. 47 (8) (2007), 1283-1286.
  M K Kerimov, On the centenary of the birth of Dimitrii Konstantinovich Faddeev, Corresponding Member of the Academy of Sciences of the USSR (1907-1989), Comput. Math. Math. Phys. 47 (8) (2007), 1229-1231.
  T Ya Kon'kova, V N Kublanovskaya and V N Simonova, On the development of certain ideas of D K Faddeev and V N Faddeeva in computational algebra (Russian), Zh. Vychisl. Mat. Mat. Fiz. 38 (12) (1998), 1955-1961.
  T Ya Kon'kova, V N Kublanovskaya and V N Simonova, On the development of certain ideas of D K Faddeev and V N Faddeeva in computational algebra, Comput. Math. Math. Phys. 38 (12) (1998), 1877-1883.
  V N Kublanovskaya, The contribution of V N Faddeeva and D K Faddeev in the development of computational methods in linear algebra (Russian), Algebra i Analiz 2 (6) (1990), 34-39.
  V N Kublanovskaya, The contribution of V N Faddeeva and D K Faddeev in the development of computational methods in linear algebra, Leningrad Math. J. 2 (6) (1991), 1187-1191.
  V N Kublanovskaya, D K. Faddeev's contribution to the development of computational methods in linear algebra (Russian), Zh. Vychisl. Mat. Mat. Fiz. 39 (2) (1999), 183-186.
  V N Kublanovskaya, D K. Faddeev's contribution to the development of computational methods in linear algebra, Comput. Math. Math. Phys. 39 (2) (1999), 173-176.
  D J Lewis, Review: Computational Methods of Linear Algebra by D K Faddeev and V N Faddeeva, Amer. Math. Monthly 73 (5) (1966), 560-561.
  D J Lewis, Review: Problems in Higher Algebra by D K Faddeev and I S Sominskii, Amer. Math. Monthly 73 (5) (1966), 559.
  J C P Miller, Review: Computational Methods of Linear Algebra by D K Faddeev and V N Faddeeva, The Mathematical Gazette 50 (373) (1966), 360-361.
  On the occasion of the seventieth birthday of Dmitrii Konstantinovich Faddeev (Russian), Zh. Vychisl. Mat. i Mat. Fiz. 17 (6) (1977), 1339-1340.
  On the occasion of the seventy-fifth birthday of Dmitrii Konstantinovich Faddeev (Russian), Zh. Vychisl. Mat. i Mat. Fiz. 22 (4) (1982), 771-772.
  I R Shafarevich, Dmitrii Konstantinovich Faddeev (Russian), Algebra i Analiz 2 (6) (1990), 3-9.
  I R Shafarevich, Dmitrii Konstantinovich Faddeev, Leningrad Math. J. 2 (6) (1991), 1159-1164.
  V V Voevodin, A Yu Kuznetsov and E E Tyrtyshnikov, A tribute to goodness, intelligence and talent (Russian), Algebra i Analiz 2 (6) (1990), 10-33.
  V V Voevodin, A Yu Kuznetsov and E E Tyrtyshnikov, A tribute to goodness, intelligence and talent, Leningrad Math. J. 2 (6) (1991), 1165-1186.
  S V Vostokov and I R Shafarevich, Harmony in algebra (On the Centenary of the Birth of Corresponding Member of the USSR Academy of Sciences D K Faddeev) (Russian), Vestnik Rossiiskoi Akademii Nauk 77 (7) (2007), 634-639.
  S V Vostokov and I R Shafarevich, Harmony in algebra (On the Centenary of the Birth of Corresponding Member of the USSR Academy of Sciences D K Faddeev), Herald of the Russian Academy of Sciences 77 (4) (2007), 404-409.
  S V Vostokov and I R Shafarevich, Harmony in algebra (on the centenary of the birth of Dmitrii Konstantinovich Faddeev, Corresponding Member of the Academy of Sciences of the USSR) (Russian) Reprint of the 2007 original, Vladikavkaz. Mat. Zh. 10 (1) (2008), 3-9.
  A V Yakovlev, D K Faddeev and St Petersburg algebraic school (Russian), Vestnik Sankt-Peterburgskogo Universiteta. Seriya 1. Matematika, Mekhanika, Astronomiya (1) (2008), 3-8.
  A V Yakovlev, D K Faddeev and St Petersburg algebraic school, Vestnik St. Petersburg Univ. Math. 41 (1) (2008), 1-4
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other websites about Dmitrii Konstantinovich Faddeev:
  
  Mathematical Genealogy Project
  MathSciNet Author profile
  zbMATH entry
  ERAM Jahrbuch entry
  
  
  
  
  
  
  Honours (show)
  
  
  
  
  Honours awarded to Dmitrii Konstantinovich Faddeev
  
  International Congress Speaker 2002
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update November 2010
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "3VymJYIB-iFoJ7CDAY3R",
          "_score": 2.0935736,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Aleksei_Ivanovich_Kostrikin",
            "biography": """
  
  
  Aleksei Ivanovich Kostrikin
  
  
  
  
  
  Quick Info
  Born
  
        12 February 1929
        
  
          Bolshoi Morets, Yelan district, Volgograd, Russia
          
  
  Died
  
        22 September 2000
        
        Moscow, Russia
      
  
  Summary
  Alexei Kostrikin was a Russian mathematician who worked in algebra and algebraic geometry.
  
  
  
  
  
      View one larger picture
  
  
  
  
  
  Biography
  Aleksei Kostrikin was the tenth and youngest child of a peasant family [4]:-
  His outstanding village schoolteachers imparted to him a love of knowledge and, in particular, mathematics.  In 1947 Kostrikin entered Saratov State University.  Being one of the best students there, he was transferred in 1951 to the Department of Mechanics and Mathematics at Moscow State University from which he graduated in 1952.
  At Moscow State University he began a long-lived association with the young professor I R Shafarevich, only six years his senior, and also began his research interests in ppp-groups and Lie algebras which were to dominate his research career.  Kostrikin worked with Shafarevich as a post-graduate at the Steklov Mathematical Institute of the Academy of Sciences of the USSR and successfully submitted a candidate's dissertation (equivalent to a Ph.D.) there in 1956.
  
  
  Kostrikin joined the staff of the Steklov Institute in 1956 and continued his association with the Steklov Institute for the rest of his career.  He also taught at the Faculty of Higher Algebra at Moscow State University beginning in 1963, becoming the head in 1977 and serving in this capacity for 23 years, from 1977 to 2000.  Kostrikin was recognized as an outstanding teacher and mentor to many young mathematicians.  He supervised over 30 candidates in the physical and mathematical sciences, including many who went on to distinguished careers in mathematics.  He maintained close relations with many of these graduate students and carried on joint work with many of them for years [4]:-  
  Despite his illness, he continued working with graduate students up to the last days of his life.
  He was both an excellent organizer and writer who, in 1977, authored a widely-used textbook Introduction to algebra (Russian) for university students that has been translated into many languages. J L Brenner writes:-
  This text, intended for 19- or 20-year old students, includes such topics as: general properties of mappings and of binary relations; some properties of simple groups; theory of representations; elements of the theory of finite fields; fields of algebraic numbers; as well as traditional subjects in a first course in algebra.
  
  
  Matrices, rings, fields, groups, polynomials, number theory, linear groups, and modules receive considerable attention. The rotation group SO(3) even has a section. Important results are given in examples in the text, and in 200 exercises (with hints and indications). Considering the youth of the university and pedagogical institute students to whom it is addressed, the book is both demanding and challenging. Also, abstraction for the sake of abstraction is wisely postponed; the concrete examples are more helpful at this stage.
  This textbook was rewritten from scratch and republished in 1994. Kostrikin writes in the Foreword about his ideas on algebra and how it should be taught. As it gives a good indication of Kostrikin's thoughts we give a fairly lengthy quote:-
  The necessity of giving a unified presentation of standard course material in algebra, linear algebra and geometry has been felt for a long time. In any case, our textbook Introduction to algebra dating from almost 20 years ago was considered from the very beginning only as the first step in an integrated approach. Algebra is a living branch of mathematics which possesses a significant attraction and is based on a small number of clear, intuitive foundations. The meaning of an algebraic concept can be of a number-theoretic or geometric nature, and frequently its roots lie in computational aspects of mathematics and in the solution of equations. The principles arising from such a historical understanding and the requirements needed in a modern university textbook in algebra remain generally accepted. The whole difficulty is in the realization of more or less known ideas. The natural evolution of the standard programs, both on behalf of unifying the courses in linear algebra and higher-dimensional analytic geometry, and on behalf of separating them and sprinkling elements of number theory into a course in algebra, are reflected in the pages of the present book, which has been based on the previously mentioned textbook of the same name, although considerably extended and divided into three parts for the convenience of readers. It is self-understood that the combination of these parts must certainly contain the stable core of these three courses, i.e., the minimum that every textbook should include.
  In 1980 Kostrikin co-authored another famous textbook Linear algebra and geometry  with Yuri Ivanovich Manin. This book contains the following chapters:
  
  Linear spaces and linear mappings.
  
  This chapter includes explanations of duality, Lie algebras, the language of category theory, and exact sequences of functors.
   
  Geometric spaces with scalar product.
  
  This chapter includes theory of orthogonalisation, self-conjugate transformations, Witt groups, and Clifford algebras.
   
  Affine and projective geometry.
  
  This chapter includes Desargues, Pappus, and graded modules.
   
  Tensor products.
  
  This chapter includes symmetry and applications to quantum mechanics.
  
  In the 1950's, Kostrikin's research centred on the restricted Burnside problem for groups of prime exponent.
  
  
  See History of the Burnside problem
  
  
  He made a major breakthrough in 1952 by proving finiteness for the case of 2 generators with an exponent of 5.  By 1958, he had developed and extended his 'sandwich' method so that he was able to prove the finiteness for any number of generators and any prime exponent.  (In 1989, Zelmanov, using ideas of Kostrikin among others, solved the restricted Burnside problem for arbitrary exponent for which he later received a Fields medal.)
  
  
  In the 1960's, Kostrikin studied infinite-dimensional Lie algebras of Cartan type for finite characteristic and, with Shafarevich, formulated a conjecture describing all simple Lie p-algebras for characteristic ppp > 5.  This conjecture motivated research in the field for many years and was finally proved by R E Black and R L Wilson.
  
  
  Two other problems to which Kostrikin contributed were [4]:-
  ... the classification of finite-dimensional non-associative algebras whose automorphism group acts transitively on all non-zero elements ...
  and
  ... the calculation of the number of unitary conservative complex polynomials and the determination of an upper bound in terms of ppp for the nilpotence class of a Lie ring having a fixed-point free automorphism of prime order.
  In the 1990's, Kostrikin discovered, with many young mathematicians, a theory of integral lattices in simple Lie algebras which are invariant under the Killing form.  These had unexpectedly rich applications to other areas such as representations of certain finite simple groups. He published (jointly with P H Tiep) Orthogonal Decompositions and Integral Lattices  in 1994. Rudolf Scharlau begins a review of the work as follows:-
  The book deals with certain "concrete" aspects of the representation theory of finite (almost) simple groups, namely with the realization of certain classes of these groups as automorphism groups of integral lattices and of related algebraic and combinatorial objects (root systems, symplectic spreads). The lattices are of a particular kind, embedded into a simple Lie algebra over C and endowed with the Killing form. The book consists almost exclusively of results obtained during the past 15 years by a group of algebraists at Moscow University, which are presented here for the first time in book form.
  Among the honours which were given to Kostrikin for his outstanding contributions we mention the State Prize of the USSR in 1968, election to corresponding member of the Academy of Sciences of USSR in 1976, the Lomonosov Prize in 1997, his invitation to address the International Congress of Mathematicians in Stockholm 1962 and also at the International Congress of Mathematicians in Nice 1970.
  
  
  
  
  
  Other Mathematicians born in Russia
  
  A Poster of Aleksei Kostrikin
  
  
  
  
  
  References (show)
  
  
  
  
  
  V A Artamonov, Yu A Bahturin, I A Chubarov, et al., Dedication: Alexei Ivanovich Kostrikin, Comm. Algebra 29 (9) (2001), ix-xiv.
  Preface : On the 70th birthday of Alexei Ivanovich Kostrikin, J. Math. Sci. (New York) 93 (6) (1999), 801-808.
  E B Vinberg, E S Golod, E I Zelmanov, et al., Aleksei Ivanovich Kostrikin [1929-2000] (Russian), Uspekhi Mat. Nauk 56 3(339) (2001), 143-145.
  E B Vinberg, E S Golod, E I Zelmanov, et al., Aleksei Ivanovich Kostrikin [1929-2000],  Russian Math. Surveys 56 (3) (2001), 559-561.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other websites about Aleksei Kostrikin:
  
  Mathematical Genealogy Project
  MathSciNet Author profile
  zbMATH entry
  
  
  
  
  
  
  Cross-references (show)
  
  
  
  
  
  History Topics: A history of the Burnside problem
  
  
  
  
  
  
      Written by Andrew Rich
  
      Last Update November 2006
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "dVymJYIB-iFoJ7CDDo-K",
          "_score": 2.0910966,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Friedrich_Wilhelm_Karl_Ernst_Schröder",
            "biography": """
  
  
  Friedrich Wilhelm Karl Ernst Schröder
  
  
  
  
  
  Quick Info
  Born
  
        25 November 1841
        
  
          Mannheim, Germany
          
  
  Died
  
        16 June 1902
        
        Karlsruhe, Germany
      
  
  Summary
  Ernst Schröder was a German mathematician who did important work is in the area of algebra, set theory and logic. His work on ordered sets and ordinal numbers is fundamental to the subject.
  
  
  
  
  
      View one larger picture
  
  
  
  
  
  Biography
  Ernst Schröder's parents were Heinrich Georg Friedrich Schröder and Karoline Walther. They were married on 9 September 1840 in Haunsheim, a district of Dillingen in Bavaria. Heinrich Schröder was born in Munich on 28 September 1810, studied at the University of Munich and became a professor of physics in high schools. He worked first at the Polytechnic School in Munich, then the Lyceum in Solothurn and, at the time Ernst was born, he was professor of physics and chemistry at the Higher Bürgerschule in Mannheim. He was very influential in encouraging the teaching of science in the gymnasiums and colleges in the district. His wife Karoline was the daughter of a pastor from Haunsheim and her father, Johann Gottfried Walther (1785-1852), tutored Ernst for two years when he was young. In fact Ernst lived with his grandfather during these two years. The Rev Walther gave his grandson an exceptionally good basic education with particular emphasis on the study of Latin. Of course Ernst's father was also a big influence on his son and, given what we have said about the work Heinrich Schröder did in fostering science education, it will come as no surprise to learn that he was a major influence on his son taking up a career in science. Ernst was the eldest of his parents four children: Clara was born in 1842; Heinrich was born in 1845 and became the director of a bank; and Walter was born in 1850 and became a businessman. After tutoring by his grandfather, Ernst studied at several different schools in Mannheim where he showed exceptional abilities in languages, chemistry, and mathematics. In 1856, when he was fifteen years old, he entered the Lyceum in Mannheim and he studied there for four years, graduating in 1860.
  
  
  After graduating from the Mannheim Lyceum, Schröder entered the University of Heidelberg. He studied mathematics under Otto Hesse, physics under Gustav Kirchhoff and chemistry under Robert Bunsen. Heidelberg was an exciting place at this time with Kirchhoff and Bunsen making fundamental advances analysing the spectrum of elements. Both Kirchhoff and Bunsen had been students of Hesse. While Schröder was undertaking research with Hesse as his advisor, several other students, who would soon become famous, were also undertaking doctoral studies with Hesse at Heidelberg. For example, Adolph Mayer (doctorate in 1861) and Heinrich Weber (doctorate in 1863) were students of Hesse at the same time as Schröder, while Olaus Henrici arrived in Heidelberg to begin his studies in 1862. The Ruprecht-Karls-Universität Heidelberg awarded Schröder a doctorate in 1862 for his thesis Über die Vielecke von gebrochener Seitenzahl oder die Bedeutung der Stern-Polygone in der Geometrie. Ⓣ(On the p/q-sided polygons or the meaning of the star-polygons in geometry) In his thesis he writes:-
  The extension of the power concept, originally only associated with integers, to rational fractions has been very fruitful in algebra; this suggests that we should try to do the same thing in geometry whenever the opportunity presents itself.
  Among examples of fractional powers, he goes on to define pq\large\frac{p}{q}\normalsizeqp​ -sided polygons.
  
  
  Hesse had been a professor at Königsberg before being appointed to Heidelberg and Kirchhoff and Bunsen had both been his students at Königsberg. Franz Neumann had been the professor of physics at Königsberg at that time and had also taught Kirchhoff and Bunsen. Hesse had taught Carl Neumann, Franz Neumann's son, so with these strong links between Franz Neumann and the staff at Heidelberg, it is little surprise that after the award of his doctorate Schröder went to Königsberg to spend two years studying mathematical physics with Franz Neumann and mathematical analysis with F J Richelot.
  
  
  In 1864, after his two years in Königsberg, Schröder took the examinations to qualify him to teach mathematics and natural sciences in gymnasiums. He took these state examinations in Baden-Baden, but then went to Zürich where he submitted his habilitation thesis to the Eidgenössische Technische Hochschule in 1865. Dipert [12] speculates that his reasons for going to Zürich may not have been entirely academic ones since he was a very enthusiastic mountain climber and made a number of difficult ascents without a guide during his time in Switzerland. Having qualified as a lecturer, he taught for a while as a Privatdozent at the Eidgenössische Technische Hochschule. Returning to Germany, he took further state teaching examinations in Baden-Baden in October 1869 and was teaching there when the Franco-Prussian War broke out in 1870. Schröder volunteered for the army and, despite his poor eyesight, he was accepted. His period of active service was, however, quite short, for towards the end of 1870 the Ministry of Education in Baden requested he return to take up an appointment as professor of mathematics and the natural sciences at the Realgymnasium in Baden-Baden. The Black Forest was rather different from the Swiss Alps, but Schröder took full advantage of the area making many long hikes during his years in Baden-Baden. In 1874 he was named a full professor at the Technische Hochschule in Darmstadt. He remained there for two years, moving to the Technische Hochschule in Karlsruhe in 1876. It is almost certain that this move came about because of Jacob Lüroth. Like Schröder, Lüroth grew up in Mannheim and the two became friends while at school there. Lüroth had been appointed professor of mathematics at the Technische Hochschule in Karlsruhe in 1869 and his signature is on Schröder's letter of appointment. Schröder remained at Karlsruhe for the rest of his career, being made Director of the Technische Hochschule for the year 1890-91.
  
  
  Ernst Schröder's important work is in the area of algebra, set theory and logic. His work on ordered sets and ordinal numbers is fundamental to the subject. However, he never considered himself to be a logician, as Peckhaus points out [22]:-
  His very own object of research was absolute algebra in respect to its basic problems and fundamental assumptions. What was the connection between logic and algebra in Schröder's research? ... one could assume that these fields belong to two separate fields of research, but this is not the case. They were intertwined in the framework of his heuristic idea of a general science.
  In fact Schröder started out being interested in mathematical physics, and his move towards logic was simply an attempt to deepen its foundations. Early in his career he wrote an important article Über iterirte Functionen Ⓣ(On iterative functions) (1871) often cited as a basis of modern dynamical systems theory. Now one sees Schröder moving towards logic with Lehrbuch der Arithmetik und Algebra für Lehrer und Studierende Ⓣ(A textbook of arithmetic and algebra for teachers and students) published by Teubner in 1873. Ivor Grattan-Guinness [5] writes:-
  In the subtitle he mentioned 'the seven algebraic operations': addition and subtraction at the 'first level', multiplication and division at the second, and exponentiation, roots and logarithms at the third. ... he put forward mathematics as 'the doctrine of numbers', rather than of magnitudes; and he stressed the algebraic bent by seeking 'absolute algebra' of which common algebra was an example.
  In 1874 he published Normale Elemente der absoluten Algebra Ⓣ(Main elements of absolute Algebra) which was written for use in the school in Baden-Baden (although it is difficult to believe that he had students capable of appreciating the ideas in this small book) and in it he continued to develop the ideas from the previous publication. He wrote his first work on mathematical logic Der Operationskreis des Logikkalkuls Ⓣ(The operation of the Logical calculus), influenced by George Boole and Hermann Grassmann, in 1877. It contained, for the first time, the formulation of the duality principle, and emphasised the duality of conjunction (intersection) and disjunction (union) showing how dual theorems could be found. He was the first to use the term 'propositional calculus' and seems to be the first to use the term 'mathematical logic'. In fact he compares algebra and Boole's logic saying:-
  There is certainly a contrast of the objects of the two operations. They are totally different. In arithmetic, letters are numbers, but here, they are arbitrary concepts.
  In Vorlesungen über die Algebra der Logik Ⓣ(Lectures on the algebra of logic), a large work published between 1890 and 1905 (it was edited and completed by Eugen Müller after his death), Schröder gave a detailed account of algebraic logic, provided a source for Alfred Tarski to develop the modern algebraic theory and gave an extensive bibliography of the history of logic. Lattice theory also grew out of this work. Brady writes [3]:-
  It offers the first exposition of abstract lattice theory, the first exposition of Dedekind's theory of chains after Dedekind, the most comprehensive development of the cakculau of relations, and a treatment of the foundations of mathematics in relation calculus that Löwenheim in 1940 still thought was as reasonable as set theory. Schröder's concept of solving a relational equation was a precursor of Skolem functions, and he inspired Löwenheim's formulation and proof of the famous theorem that every sentence with an infinite model has a countable model, the first real theorem of modern logic.
  Schröder said his aim was (see for example [22]):-
  ... to design logic as a calculating discipline, especially to give access to the exact handling of relative concepts, and, from then on, by emancipation from the routine claims of natural language, to withdraw any fertile soil from "cliché" in the field of philosophy as well. This should prepare the ground for a scientific universal language that, widely differing from linguistic efforts like Volapük [a universal language like Esperanto, very popular in Germany at the time], looks more like a sign language than like a sound language.
  Schröder had a very high opinion of Charles Sanders Peirce. The two corresponded but Peirce showed a more mixed attitude towards Schröder, sometimes praising him while on other occasions he was highly critical. Brady writes [3]:-
  Schröder developed Peirce's relative calculus much further and much more systematically than did Peirce. Schröder considered quantifiers (or, at least, sums and products equivalent to quantifiers for a fixed domain) in first- and higher-order logic. He understood that there are notions such as countability that are beyond relative calculus (and also beyond first-order predicate logic).
  Dipert [12] gives an interesting account of Schröder's character which he compares with that of Peirce:-
  As concerns Schröder's personality, Schröder was apparently an extremely even-tempered and gentle man. All his biographers attest to this fact, and these qualities are shown conspicuously in his correspondence with Peirce, and his generosity toward Christine Ladd-Franklin and her young daughter, Margaret. The Vorlesungen is, rather unusual for the times, careful to note the work of others and never takes vague credit for what was in fact others' work. While Peirce overall praised Schröder, he nevertheless sometimes ferociously attacked him, in print and in private correspondence. Schröder venerated Peirce, however, and had in abundance what Peirce acknowledged he lacked: self-control.
  Putman shows the respect which Schröder was held in a hundred years after he completed the work [25]:-
  When I started to trace the later development of logic, the first thing I did was to look at Schröder's 'Vorlesungen über die Algebra der Logik', ... [whose] third volume is on the logic of relations (Algebra und Logik der Relative, 1895). The three volumes immediately became the best-known advanced logic text, and embody what any mathematician interested in the study of logic should have known, or at least have been acquainted with, in the 1890s.
  However, as Wussing writes in [1], this respect for Schröder was not nearly so evident in his own day:-
  Schröder participated in the development of mathematical logic as an independent discipline in the second half of the nineteenth century. This is his real achievement, although his contribution was not recognised until the beginning of the twentieth century. Three factors account for the delay: the imature state of the field during his lifetime; a certain prolixity in his style; and, above all, the isolation imposed by his teaching in technical colleges. As a result he was an outsider, at a disadvantage in chosing terminology, in outlining his argumentation, and in judging what mathematical logic could accomplish.
  Schröder had many sporting hobbies: cycling, hiking, swimming, ice-skating, horseback riding, and gardening. Because he was always seen riding his bicycle around Karlsruhe he was known locally as the 'Bicycle-professor'. He even took up skiing when he was sixty years old. He never married but seemed to find that his duties in the Technische Hochschule Karlsruhe extremely demanding, perhaps because he undertook them very conscientiously. Certainly he found it very difficult to find the necessary time to complete his major three volume work Vorlesungen über die Algebra der Logik Ⓣ(Lectures on the algebra of logic). Schröder's father Heinrich retired in 1873 and, a year after his wife Karoline died in 1875, he moved to Karlsruhe to be close to his sons Ernst and Heinrich; Heinrich Schröder died in 1885. Given what a fit man Ernst Schröder was, it is surprising that he died at the age of 60. He was skiing and cycling days before his death, but caught a cold. This seemed to worsen over the course of a few days and he died of "brain fever" according to the death certificate. Many of his friends felt that his strenuous sporting life at the age of sixty had led to his premature death. He was buried in the main cemetery of Karlsruhe quite close to the apartment in which he had lived. Having no close relatives to continue tending his grave, following the usual custom it was reused after a period of 30 years so today there is no record remaining in the cemetery.
  
  
  It is interesting to note that in June 1913 Norbert Wiener presented his doctoral thesis to Harvard University; Wiener was then 18 years old. The thesis was devoted to a comparison of the logical systems of Ernst Schröder and Bertrand Russell, with special attention to their different treatments of relations. There is an interesting discussion of this and subsequent developments in [15].
  
  
  
  
  
  Other Mathematicians born in Germany
  
  A Poster of Ernst Schröder
  
  
  
  
  
  References (show)
  
  
  
  
  
  H Wussing, Biography in Dictionary of Scientific Biography (New York 1970-1990). See THIS LINK.
  D Bondoni, La teoria delle relazioni nell'algebra della logica schroderiana (Milan, 2007).
  G Brady, From Pierce to Skolem: A Neglected Chapter in the History of Logic (Elsevier, 2000).
  J Gasser, A Boole Anthology : Recent and Classical Studies in the Logic of George Boole (Springer-Verlag, 2000).
  I Grattan-Guinness, The Search for Mathematical Roots, 1870-1940 : Logics, Set Theories and the Foundations of Mathematics from Cantor Through Russell to Gödel (Princeton University Press, 2000).
  A N Kolmogorov, A P Yushkevich, A Shenitzer, H Grant and O B Sheinin, Mathematics of the 19th Century : Mathematical Logic, Algebra, Number Theory, Probability Theory (Birkhäuser, 2001).
  V Peckhaus, Logik, Mathesis universalis und allgemeine Wissenschaft. Leibniz und die Wiederentdeckung der formalen Logik im 19. Jahrhundert (Akademie-Verlag. 1997).
  G van Brummelen and M Kinyon, Mathematics and the Historian's Craft : The Kenneth O. May Lectures (Springer-Verlag, 2005).
  I H Anellis, Schröder material at the Russell archives, Modern Logic 1 (2-3) (1990/91), 237-245.
  R Crespo, Ernesto Schröder (Spanish), Gaceta Mat. (1) 3 (1951), 211-214.
  R R Dipert, Individuals and extensional logic in Schröder's Vorlesungen über die Algebra der Logik, Modern Logic 1 (2-3) (1990/91), 140-159.
  R R Dipert, The life and work of Ernst Schröder, Modern Logic 1 (2-3) (1990/91), 117-139.
  F Ferrante, The origins of thought in Ernst Schröder's Introduction to lessons on algebra of logic (1890), Metalogicon 9 (2) (1996), 105-137.
  F Ferrante, 'Folgerichtigkeit' - the basic conception of logical thought in Ernst Schröder's introduction to [his] Lessons on algebra of logic (1890), Metalogicon 8 (1) (1995), 33-40.
  I Grattan-Guinness, Wiener on the logics of Russell and Schröder: An account of his doctoral thesis, and of his discussion of it with Russell, Ann. of Sci. 32 (1975), 103-132.
  L Gruszecki, Ernst Schröder's algebra of logic, Zeszyty Nauk. Politech. Rzeszowskiej Mat. No. 27 (2004), 25-28.
  N Houser, The Schröder-Peirce correspondence, Modern Logic 1 (2-3) (1990/91), 206-236.
  S G Ibragimov, On forgotten works of Ernst Schröder lying between algebra and logic (Russian), Istor.-Mat. Issled. 17 (1966), 247-258.
  J Lüroth, Nekrolog auf Ernst Schröder, Jahresberichte der Deutschen Mathematiker-Vereinigung 12 (1903), 249-265.
  V Peckhaus, Wozu Algebra der Logik? Ernst Schröders Suche nach einer universalen Theorie der Verknüpfungen, Modern Logic 4 (4) (1994), 357-381.
  V Peckhaus, Ernst Schröder und die 'pasigraphischen Systeme' von Peano und Peirce, Modern Logic 1 (2-3) (1990/91), 174-205.
  V Peckhaus, 19th Century Logic between Philosophy and Mathematics, Bulletin of Symbolic Logic 5 (1999), 433-450.
  V Peckhaus, The influence of Hermann Günther Grassmann and Robert Grassmann on Ernst Schröder's algebra of logic, in Hermann Günther Grassmann (1809-1877): visionary mathematician, scientist and neohumanist scholar, Boston Stud. Philos. Sci. 187 (Dordrecht, 1996), 217-227.
  V Peckhaus, Schröder's Logic, in D M Gabbay and John Woods (eds.), Handbook of the History of Logic. Vol. 3: The Rise of Modern Logic: From Leibniz to Frege (North Holland, 2004), 557-609.
  H Putman, Peirce the Logician, Historia Mathematica 9 (1982), 290-301.
  C Thiel, Ernst Schröder and the distribution of quantifiers, Modern Logic 1 (2-3) (1990/91), 160-173.
  C Thiel, A portrait, or, how to tell Frege from Schröder, Hist. Philos. Logic 2 (1981), 21-23.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other websites about Ernst Schröder:
  
  Dictionary of Scientific Biography
  Mathematical Genealogy Project
  MathSciNet Author profile
  zbMATH entry
  ERAM Jahrbuch entry
  
  
  
  
  
  
  Cross-references (show)
  
  
  
  
  
  History Topics: A history of set theory
  Other: 1900 ICM - Paris
  Other: Earliest Known Uses of Some of the Words of Mathematics (D)
  Other: Earliest Known Uses of Some of the Words of Mathematics (L)
  Other: Earliest Uses of Symbols of Set Theory and Logic
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update April 2009
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "F1ymJYIB-iFoJ7CDK5PN",
          "_score": 2.0891078,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Vera_Nikolaevna_Faddeeva",
            "biography": """
  
  
  Vera Nikolaevna Faddeeva
  
  
  
  
  
  Quick Info
  Born
  
        20 September 1906
        
  
          Tambov, Russia
          
  
  Died
  
        15 April 1983
        
        Leningrad, USSR (now St Petersburg, Russia)
      
  
  Summary
  Vera Nikolaevna Faddeeva was a Russian mathematician who worked in the field of numerical linear algebra.
  
  
  
  
  
      View one larger picture
  
  
  
  
  
  Biography
  Vera Nikolaevna Faddeeva's father was Nikolai Zamyatin (Faddeeva is her married name following her marriage to Dmitrii Konstantinovich Faddeev). She was born in Tambov, a town about 470 km south east of Moscow and 470 km north east of Kharkiv. In 1927 she entered the Faculty of Physics and Mathematics at Leningrad State Pedagogical Institute but transferred in the following year to Leningrad State University. Advised by Nikolai Maksimovich Gyunter (1871-1941), an expert on the Stieltjes integral and its applications to mathematical physics, she graduated in 1930 and, in the same year, married the mathematician Dmitrii Konstantinovich Faddeev. They had three children, one of whom was Ludwig Dmitrievich Faddeev who was educated in the Faculty of Physics at Leningrad State University and went on to become an outstanding mathematician and theoretical physicist producing ideas and results which are at the forefront of today's research.
  
  
  The years during which Vera Nikolaevna was an undergraduate at Leningrad State University were ones of great difficulty for the academics at the university. During this period independent thinkers were persecuted and N M Gyunter, at that time President of the Leningrad Mathematical Society and a man with a reputation for courage and independent thought, was in great danger. In fact the Leningrad Mathematical Society was disbanded in 1930 following a proposal by the vice-president Vladimir Ivanovich Smirnov, in a successful attempt to save Gyunter's life and the lives of other mathematicians. Following her graduation, Faddeeva worked at the Leningrad Board of Weights and Measures (as her husband had done in the previous couple of years). She was employed as an assistant at the Leningrad Hydraulic Engineering Institute from 1930 to 1934 and, in 1933-34, also as a junior researcher at the Seismology Institute of the USSR Academy of Sciences. For three years, beginning in 1935, she worked as a researcher at the Leningrad Institute of Constructions being part of a team led by Boris Grigorievich Galerkin [3]:-
  During those years, she gained much experience in applied mathematics and sophisticated computational techniques.
  Faddeeva undertook graduate study at the Leningrad Pedagogical Institute for three years, beginning in 1938. In September 1939, Russia, allied with Germany, invaded Poland from the east. This had little effect on life in Leningrad. However, in June 1941 the course of the war changed dramatically for those living in Russia since Germany invaded their country. By the following month Hitler had plans to take both Leningrad and Moscow. As the German armies rapidly advanced towards Leningrad, many people were evacuated from the city including Faddeeva and her family. For the duration of the siege of Leningrad, Faddeeva lived in Kazan, about 800 km due east of Moscow and considered safe from the German invasion. For a long time there was no opportunity to return to Leningrad which was only liberated from the siege in January 1944. Even after the siege was lifted, access to the devastated city was for a considerable time only possible with a special permit. Faddeeva, together with her husband and other academics, obtained such permits and again Leningrad State University began to operate.
  
  
  She had been appointed as a junior researcher at the Leningrad Division of the Steklov Institute of Mathematics of the USSR Academy of Sciences in 1942 and continued to work for the Institute for the rest of her career. After submitting her candidate's thesis On One Problem in Mathematical Physics to Leningrad State University in 1946 she was awarded the degree (equivalent to a Ph.D.). In 1949 she published the papers The method of lines applied to some boundary problems and On fundamental functions of the operator X^{IV} . In the following year she published two books; one of these was a table of Bessel functions which she wrote in collaboration with Mark Konstantinovich Gavurin (1911-1992), and the other her famous treatise Computational methods of linear algebra. Gavurin was a colleague of Faddeeva and, together with Leonid Vitalyevich Kantorovich, he had set up a computational mathematics unit within the mathematical analysis department at Leningrad State University in 1948. This unit became the basis for the Department of Computational Mathematics set up in 1951. Faddeeva was closely associated with the computational developments by Kantorovich, especially at the Steklov Institute of Mathematics where she became head of the Laboratory of Numerical Computations.
  As the head of Laboratory, Vera Nikolaevna guided investigations in various scientific fields related to numerical mathematics. Jointly with S G Mikhlin, she headed the scientific seminar of the Leningrad Division of the Steklov Institute of Mathematics of the USSR Academy of Sciences on numerical methods. The seminar's activity exceeded the limits of the Laboratory. Not only researchers from the Steklov Institute but also many Soviet and foreign scientists working on numerical mathematics took part in the seminar. The Laboratory received many visitors, among whom were such known scientists as James Hardy Wilkinson (Great Britain), George Elmer Forsythe (USA), Richard Steven Varga (USA), Gene Howard Golub (USA), Rózsa Péter (Hungary), Miroslav Fiedler (Czechoslovakia), Axel Ruhe (Sweeden), B D Vulichevich (Yugoslavia), and others.
  Reviewing Faddeeva's classic 1950 book Computational methods of linear algebra, G E Forsythe writes:-
  This is a textbook on numerical methods for solving finite systems of linear equations, inverting matrices, and calculating the eigenvalues of finite matrices, all with desk calculators. Although the book is far from exhaustive, the mathematical elegance, the breadth of material, and the number of error-free numerical examples make this by far the finest book to appear in the field.
  The first chapter of this book was translated into English for the National Bureau of Standards in the United States in 1952 and, in 1959, an English translation of the whole book was published. [12]:-
  The first chapter of this book forms a clear and well-written introduction to the elementary parts of linear algebra. The second chapter deals with numerical methods for the solution of systems of linear equations and the inversion of matrices, and the third with methods for computing characteristic roots and vectors of a matrix. Most of the important material in these domains is to be found here, and many numerical examples which illustrate the algorithms and point out their merits and deficiencies are given. The discussion is directed principally to the hand computer, and machine computation in the modern sense is hardly present, but the book must be regarded as a valuable guide for the worker in the general area of linear computation.
  Olga Taussky-Todd, after giving a similar guide to the contents, writes that the book will serve [13]:-
  ... a very useful purpose for researchers, as well as for teachers and students of numerical analysis, because of the clear presentation of the basic facts.
  MathSciNet lists around 40 papers by Faddeeva including 20 joint papers with her husband on numerical analysis including their most famous work, the book Computational methods of linear algebra which appeared in Russian in 1960. This monograph was awarded a State Prize. It was translated into English and published in 1963, the same year in which an enlarged and revised Russian version was published. Note that in 1975 the two authors produced another major work summarizing progress made on numerical linear algebra during the years 1962-1974. Unfortunately the English translation of the 1960 monograph left much to be desired and most reviewers concentrate their comments more on the deficiencies of the translation than on the contents. However, J C P Miller [11] does note that the Russian book is an exceptional work:-
  The original edition of this book in Russian is undoubtedly a very stimulating and valuable book, and translation into English is a very worthwhile task. The content of the book is comprehensive, with much material that does not appear to have been collected together previously.
  Alston Householder [1] writes:-
  Each edition was, at the time of its appearance, by far the most complete and up-to-date treatment of the subject in print.
  We mentioned above the 20 joint papers by Faddeeva and her husband, noting that some of the last few of these were: Natural norms in algebraic processes (1970), On the question of the solution of linear algebraic systems (1974), Parallel calculations in linear algebra (Part 1 in 1977, Part 2 in 1982), and A view of the development of numerical methods of linear algebra (1977). Faddeeva's final paper was the single authored Numerical methods of linear algebra in computer formulation (1984) which is the text of a lecture she gave at the 'Computational mathematics' Conference in Warsaw in 1980.
  
  
  Finally let us record something of Faddeeva's character [3]:-
  Faddeeva was not only a remarkable researcher and a notable organizer and manager but also a bright versatile personality. A lively and determined woman, she was sincerely interested in everything that pertained to her institution and cared about her colleagues. Faddeeva loved life and enjoyed it. She was keen on classical music, backpacking trips, and other types of travel. She loved her family and children and took much care of them and her husband. Everyone who knew Faddeeva in person or through her perfect writings will never forget this wonderful researcher and woman.
  Vera Kublanovskaya, who worked with Faddeeva for many years, paints a similar picture [9]:-
  In the memory of everyone who knew Vera Nikolaevna, she has remained not only a remarkable scientist and excellent organizer but also a brilliant and many-sided personality. She inhered ebullient vitality, firmness of purpose and keen concern about all matters related to the Steklov Institute of Mathematics, her second home, and to her colleagues. Vera Nikolaevna also took trouble about people with whom she was not personally acquainted. She had a talent for enjoying life. Theatre, classical music, travels, and tours were only some of the many passions of this richly endowed person.
  
  
  
  
  
  Other Mathematicians born in Russia
  
  A Poster of Vera Nikolaevna Faddeeva
  
  
  
  
  
  References (show)
  
  
  
  
  
  A S Householder, Review: Computational Methods of Linear Algebra by D K Faddeev and V N Faddeeva, Mathematics of Computation 18 (87) (1964), 512-513.
  M K Kerimov, In memory of Vera Nikolaevna Faddeeva (on the centenary of her birth) (Russian), Zhurnal Vychislitel'noi Matematiki i Matematicheskoi Fiziki 47 (7) (2007), 1276-1280.
  M K Kerimov, In memory of Vera Nikolaevna Faddeeva (on the centenary of her birth), Comput. Math. Math. Phys. 47 (7) (2007), 1224-1227.
  T Ya Kon'kova, V N Kublanovskaya and V N Simonova, On the development of certain ideas of D K Faddeev and V N Faddeeva in computational algebra (Russian), Zh. Vychisl. Mat. Mat. Fiz. 38 (12) (1998), 1955-1961.
  T Ya Kon'kova, V N Kublanovskaya and V N Simonova, On the development of certain ideas of D K Faddeev and V N Faddeeva in computational algebra, Comput. Math. Math. Phys. 38 (12) (1998), 1877-1883.
  V N Kublanovskaya, The contribution of V N Faddeeva and D K Faddeev in the development of computational methods in linear algebra (Russian), Algebra i Analiz 2 (6) (1990), 34-39.
  V N Kublanovskaya, The contribution of V N Faddeeva and D K Faddeev in the development of computational methods in linear algebra, Leningrad Math. J. 2 (6) (1991), 1187-1191.
  V N Kublanovskaya and L Yu Kolotilina, On the occasion of the centenary of the birthday of Vera Nikolaevna Faddeeva (Russian), Zap. Nauchn. Sem. S.-Peterburg. Otdel. Mat. Inst. Steklov. (POMI) 334 (19) (2006), 7-12.
  V N Kublanovskaya and L Yu Kolotilina, On the occasion of the centenary of the birthday of Vera Nikolaevna Faddeeva, J. Math. Sci. (N. Y.) 141 (6) (2007), 1573-1575.
  D J Lewis, Review: Computational Methods of Linear Algebra by D K Faddeev and V N Faddeeva, Amer. Math. Monthly 73 (5) (1966), 560-561.
  J C P Miller, Review: Computational Methods of Linear Algebra by D K Faddeev and V N Faddeeva, The Mathematical Gazette 50 (373) (1966), 360-361.
  M Newman, Review: Computational Methods of Linear Algebra by V N Faddeeva, Mathematics of Computation 15 (74) (1961), 201.
  O Taussky-Todd, Review : Computational Methods of Linear Algebra by V N Faddeeva, The Mathematical Gazette 44 (348) (1960), 139-140.
  V V Voevodin, A Yu Kuznetsov and E E Tyrtyshnikov, A tribute to goodness, intelligence and talent (Russian), Algebra i Analiz 2 (6) (1990), 10-33.
  V V Voevodin, A Yu Kuznetsov and E E Tyrtyshnikov, A tribute to goodness, intelligence and talent, Leningrad Math. J. 2 (6) (1991), 1187-1191.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other websites about Vera Nikolaevna Faddeeva:
  
  MathSciNet Author profile
  zbMATH entry
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update November 2010
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "gFymJYIB-iFoJ7CDJ5IC",
          "_score": 2.0844817,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Robert_Charles_Thompson",
            "biography": """
  
  
  Robert Charles Thompson
  
  
  
  
  
  Quick Info
  Born
  
        21 April 1931
        
  
          Winnipeg, Manitoba, Canada
          
  
  Died
  
        10 December 1995
        
        Santa Barbara, California, USA
      
  
  Summary
  Robert C Thompson was an Canadian mathematician who moved to the USA. He worked on linear algebra and matrix theory.
  
  
  
  
  
  Biography
  Although Robert Thompson was born in Winnipeg, he grew up close to Vancouver in British Columbia, and it was in British Columbia that his school and undergraduate university education took place. He entered the University of British Columbia in Vancouver where he received his bachelor's degree, and then continued to study for his master's degree at the same university. For his doctoral studies, however, Thompson moved to the United States, and he became Olga Taussky-Todd's first Ph.D. student at California Institute of Technology, beginning his studies shortly after she arrived there with her husband.
  
  
  Thompson was awarded a Ph.D. in 1960 for his thesis Commutators in the Special and General Linear Groups. In 1961 Thompson published a paper Commutators in the special and general linear groups in the Transactions of the American Mathematical Society which was based on results from his thesis. In the paper he looks at matrices over a field KKK with at least 4 elements. He proves that a matrix AAA in SL(n,K)SL(n, K)SL(n,K) can be written in the form B−1C−1BCB^{-1}C^{-1}BCB−1C−1BC, where B,CB, CB,C belong to SL(n,K)SL(n, K)SL(n,K), except perhaps when AAA is a scalar matrix and KKK has characteristic 0. A scalar matrix in SL(n,K)SL(n, K)SL(n,K) is, however, a product of two commutators. Although the paper does not examine the cases where K=GF(2)K = GF(2)K=GF(2) or GF(3)GF(3)GF(3), Thompson gave complete information about these in his thesis and went on to publish the results for K=GF(3)K = GF(3)K=GF(3) in On matrix commutators (1962) and the case for K=GF(2)K = GF(2)K=GF(2) in Commutators of matrices with coefficients from the field of two elements (1962) published in the Duke Mathematical Journal. These papers are described by Charles R Johnson and Morris Newman in the following way:-
  In that very detailed work, Thompson answered nearly all the major questions in the subject and revealed what would become a hallmark of his work: a willingness and an ability to make unusually elaborate algebraic calculations in order to answer a question. It was not that he did not appreciate external or efficient, implicit tools if they were available. Quite the contrary: he was a major proponent of the use of other parts of mathematics that could be useful in matrix theory.
  After Thompson was awarded his doctorate he returned to Canada, going back to the University of British Columbia where he was on the faculty for three years. In 1963 he moved to the University of California at Santa Barbara where he remained on the faculty for the rest of his career.
  
  
  Thompson published over 120 papers and four undergraduate textbooks during his career. He attacked problems over a long period with great persistence and emphasis on detail. As a result he published a number of series of papers attacking particular problems. For example, he published nine papers on Principal submatrices in which he conducted a deep investigation of interlacing properties relating the eigenvalues of a matrix to the eigenvalues of a principal submatrix. For example Invariant factors of integral quaternion matrices which Thompson published in Linear and Multilinear Algebra in 1987 was reviewed by Morris Newman as follows:-
  [Thompson's] purpose in this paper is to develop the theory of unimodular equivalence for matrices whose entries come from the Hurwitz ring of integral quaternions. This is done in complete detail, and a normal form is obtained which exhibits as much uniqueness as is possible for the case of a noncommutative ring. The author also proves a number of results concerned with the relationship between the invariant factors of a full matrix and the invariant factors of a submatrix, which generalize his earlier work on this subject.
  In 1990 Thomson spoke at a conference in Auburn, Alabama. His lecture High, low, and quantitative roads in linear algebra. Directions in matrix theory was a particularly interesting one for in it he attempted to predict the future direction of core linear algebra. He discussed: quantitative prediction; high and low roads; the numerical range; similarity invariants of principal submatrices; commutators; the triangle inequality; the facial structure of the unit ball; the Gershgorin circle theorem; matrices, graphs, inertia, number theory; power embeddings and dilatations; the Schubert calculus; the spectrum of a sum of Hermitian matrices; the Hadamard-Schur product; the exponential function; the exponential function and commutativity; integral quadratic forms; the matrix-valued numerical range; inequalities with subtracted terms; and further uses of the computer.
  
  
  Editorial work was important to Thompson: he was a contributing editor of Linear Algebra and its Applications and an editor of the Society for Industrial and Applied Mathematics Journal on Matrix Analysis. Thompson's influence on linear algebra was felt in other ways too for he was one of the founders of the International Linear Algebra Society and of the journal Linear and Multilinear Algebra. Given this experience his article Author vs. referee: a case history for middle level mathematicians which appeared in the American Mathematical Monthly in 1983 is all the more interesting. He explains in the introduction why he wrote it:-
  This note evolved from a referee's rejection of a research paper that I wrote. The reasoning behind the rejection was perhaps unusual, and leads to a not altogether trivial question concerning the role of the referee in the professional development of a mathematician. The discussion will be more candid than is customary, and this may add spice to the article, since confession of failure, or even of sin, is always interesting.
  Thompson's health deteriorated and heart problems were diagnosed:-
  He retained his sense of humour and optimism to the end; although fully aware of his condition, he did not let it interfere with his work or discourage him. In fact, shortly before his death, he mentioned that he had told his doctors they were obligated to keep him alive for at least four more years, since he had just purchased an athletic club membership for that amount of time.
  Sadly the doctors failed to give him four years for he died while waiting for a heart transplant. Sadly the award of the International Linear Algebra Society's Hans Schneider Prize in Linear Algebra came after his death.
  
  
  
  
  
  Other Mathematicians born in Canada
  
  
  
  
  
  References (show)
  
  
  
  
  
  J M Day, Robert C Thompson, 1931-1995, Linear and Multilinear Algebra 43 (1-3) (1997), 13-18.
  C R Johnson, In memoriam : Robert C Thompson (1931-1995), SIAM J. Matrix Anal. Appl. 17 (3) (1996), 463-464.
  M Newman, The work of Robert C Thompson, Linear and Multilinear Algebra 43 (1-3) (1997), 1-6.
  Robert C Thompson research articles, Linear and Multilinear Algebra 43 (1-3) (1997), 7-11.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other websites about Robert C Thompson:
  
  University of California
  Mathematical Genealogy Project
  MathSciNet Author profile
  zbMATH entry
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update November 2004
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "ulymJYIB-iFoJ7CDAI29",
          "_score": 2.0825303,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Abu_Ja'far_Muhammad_ibn_Musa_Al-Khwarizmi",
            "biography": """
  
  
  Abu Ja'far Muhammad ibn Musa Al-Khwarizmi
  
  
  
  
  
  Quick Info
  Born
  
        about 780
        
  
          possibly Baghdad (now in Iraq)
          
  
  Died
  
        about 850
        
        
      
  
  Summary
  Al'Khwarizmi was an Islamic mathematician who wrote on Hindu-Arabic numerals. The word algorithm derives from his name. His algebra treatise Hisab al-jabr w'al-muqabala gives us the word algebra and can be considered as the first book to be written on algebra.
  
  
  
  
  
      View three larger pictures
  
  
  
  
  
  Biography
  We know few details of Abu Ja'far Muhammad ibn Musa al-Khwarizmi's life. One unfortunate effect of this lack of knowledge seems to be the temptation to make guesses based on very little evidence. In [1] Toomer suggests that the name al-Khwarizmi may indicate that he came from Khwarizm south of the Aral Sea in central Asia. He then writes:-
  But the historian al-Tabari gives him the additional epithet "al-Qutrubbulli", indicating that he came from Qutrubbull, a district between the Tigris and Euphrates not far from Baghdad, so perhaps his ancestors, rather than he himself, came from Khwarizm ... Another epithet given to him by al-Tabari, "al-Majusi", would seem to indicate that he was an adherent of the old Zoroastrian religion. ... the pious preface to al-Khwarizmi's "Algebra" shows that he was an orthodox Muslim, so Al-Tabari's epithet could mean no more than that his forebears, and perhaps he in his youth, had been Zoroastrians.
  However, Rashed [7], put a rather different interpretation on the same words by Al-Tabari:-
  ... Al-Tabari's words should read: "Muhammad ibn Musa al-Khwarizmi and al-Majusi al-Qutrubbulli ...", (and that there are two people al-Khwarizmi and al-Majusi al-Qutrubbulli): the letter "wa" was omitted in the early copy. This would not be worth mentioning if a series of conclusions about al-Khwarizmi's personality, occasionally even the origins of his knowledge, had not been drawn. In his article ([1]) G J Toomer, with naive confidence, constructed an entire fantasy on the error which cannot be denied the merit of making amusing reading.
  This is not the last disagreement that we shall meet in describing the life and work of al-Khwarizmi. However before we look at the few facts about his life that are known for certain, we should take a moment to set the scene for the cultural and scientific background in which al-Khwarizmi worked.
  
  
  Harun al-Rashid became the fifth Caliph of the Abbasid dynasty on 14 September 786, about the time that al-Khwarizmi was born. Harun ruled, from his court in the capital city of Baghdad, over the Islam empire which stretched from the Mediterranean to India. He brought culture to his court and tried to establish the intellectual disciplines which at that time were not flourishing in the Arabic world. He had two sons, the eldest was al-Amin while the younger was al-Mamun. Harun died in 809 and there was an armed conflict between the brothers.
  
  
  Al-Mamun won the armed struggle and al-Amin was defeated and killed in 813. Following this, al-Mamun became Caliph and ruled the empire from Baghdad. He continued the patronage of learning started by his father and founded an academy called the House of Wisdom where Greek philosophical and scientific works were translated. He also built up a library of manuscripts, the first major library to be set up since that at Alexandria, collecting important works from Byzantium. In addition to the House of Wisdom, al-Mamun set up observatories in which Muslim astronomers could build on the knowledge acquired by earlier peoples.
  
  
  Al-Khwarizmi and his colleagues the Banu Musa were scholars at the House of Wisdom in Baghdad. Their tasks there involved the translation of Greek scientific manuscripts and they also studied, and wrote on, algebra, geometry and astronomy. Certainly al-Khwarizmi worked under the patronage of Al-Mamun and he dedicated two of his texts to the Caliph. These were his treatise on algebra and his treatise on astronomy. The algebra treatise Hisab al-jabr w'al-muqabala was the most famous and important of all of al-Khwarizmi's works. It is the title of this text that gives us the word "algebra" and, in a sense that we shall investigate more fully below, it is the first book to be written on algebra.
  
  
  Rosen's translation of al-Khwarizmi's own words describing the purpose of the book tells us that al-Khwarizmi intended to teach [11] (see also [1]):-
  ... what is easiest and most useful in arithmetic, such as men constantly require in cases of inheritance, legacies, partition, lawsuits, and trade, and in all their dealings with one another, or where the measuring of lands, the digging of canals, geometrical computations, and other objects of various sorts and kinds are concerned.
  This does not sound like the contents of an algebra text and indeed only the first part of the book is a discussion of what we would today recognise as algebra. However it is important to realise that the book was intended to be highly practical and that algebra was introduced to solve real life problems that were part of everyday life in the Islam empire at that time. Early in the book al-Khwarizmi describes the natural numbers in terms that are almost funny to us who are so familiar with the system, but it is important to understand the new depth of abstraction and understanding here [11]:-
  When I consider what people generally want in calculating, I found that it always is a number. I also observed that every number is composed of units, and that any number may be divided into units. Moreover, I found that every number which may be expressed from one to ten, surpasses the preceding by one unit: afterwards the ten is doubled or tripled just as before the units were: thus arise twenty, thirty, etc. until a hundred: then the hundred is doubled and tripled in the same manner as the units and the tens, up to a thousand; ... so forth to the utmost limit of numeration.
  Having introduced the natural numbers, al-Khwarizmi introduces the main topic of this first section of his book, namely the solution of equations. His equations are linear or quadratic and are composed of units, roots and squares. For example, to al-Khwarizmi a unit was a number, a root was xxx, and a square was x2x^{2}x2. However, although we shall use the now familiar algebraic notation in this article to help the reader understand the notions, Al-Khwarizmi's mathematics is done entirely in words with no symbols being used.
  
  
  He first reduces an equation (linear or quadratic) to one of six standard forms:
  1. Squares equal to roots.
  
  2. Squares equal to numbers.
  
  3. Roots equal to numbers.
  
  4. Squares and roots equal to numbers; e.g. x2+10x=39x^{2} + 10 x = 39x2+10x=39.
  
  5. Squares and numbers equal to roots; e.g. x2+21=10xx^{2} + 21 = 10 xx2+21=10x.
  
  6. Roots and numbers equal to squares; e.g. 3x+4=x23 x + 4 = x^{2}3x+4=x2.
  The reduction is carried out using the two operations of al-jabr and al-muqabala. Here "al-jabr" means "completion" and is the process of removing negative terms from an equation. For example, using one of al-Khwarizmi's own examples, "al-jabr" transforms x2=40x−4x2x^{2} = 40 x - 4 x^{2}x2=40x−4x2 into 5x2=40x5 x^{2} = 40 x5x2=40x. The term "al-muqabala" means "balancing" and is the process of reducing positive terms of the same power when they occur on both sides of an equation. For example, two applications of "al-muqabala" reduces 50+3x+x2=29+10x50 + 3 x + x^{2} = 29 + 10 x50+3x+x2=29+10x to 21+x2=7x21 + x^{2} = 7 x21+x2=7x (one application to deal with the numbers and a second to deal with the roots).
  
  
  Al-Khwarizmi then shows how to solve the six standard types of equations. He uses both algebraic methods of solution and geometric methods. For example to solve the equation x2+10x=39x^{2} + 10 x = 39x2+10x=39 he writes [11]:-
  ... a square and 10 roots are equal to 39 units. The question therefore in this type of equation is about as follows: what is the square which combined with ten of its roots will give a sum total of 39? The manner of solving this type of equation is to take one-half of the roots just mentioned. Now the roots in the problem before us are 10. Therefore take 5, which multiplied by itself gives 25, an amount which you add to 39 giving 64. Having taken then the square root of this which is 8, subtract from it half the roots, 5 leaving 3. The number three therefore represents one root of this square, which itself, of course is 9. Nine therefore gives the square.
  
  
  The geometric proof by completing the square follows. Al-Khwarizmi starts with a square of side xxx, which therefore represents x2x^{2}x2 (Figure 1). To the square we must add 10x10x10x and this is done by adding four rectangles each of breadth 10/4 and length xxx to the square (Figure 2). Figure 2 has area x2+10xx^{2} + 10 xx2+10x which is equal to 39. We now complete the square by adding the four little squares each of area 52×52=254\large\frac{5}{2}\normalsize   \times  \large\frac{5}{2}\normalsize   = \large\frac{25}{4}\normalsize25​×25​=425​. Hence the outside square in Fig 3 has area 4×254+39=25+39=644 \times  \large\frac{25}{4}\normalsize  + 39 = 25 + 39 = 644×425​+39=25+39=64. The side of the square is therefore 8. But the side is of length 52+x+52\large\frac{5}{2}\normalsize  + x + \large\frac{5}{2}\normalsize25​+x+25​ so x+5=8x + 5 = 8x+5=8, giving x=3x = 3x=3.
  
  
  These geometrical proofs are a matter of disagreement between experts. The question, which seems not to have an easy answer, is whether al-Khwarizmi was familiar with Euclid's Elements. We know that he could have been, perhaps it is even fair to say "should have been", familiar with Euclid's work. In al-Rashid's reign, while al-Khwarizmi was still young, al-Hajjaj had translated Euclid's Elements into Arabic and al-Hajjaj was one of al-Khwarizmi's colleagues in the House of Wisdom. This would support Toomer's comments in [1]:-
  ... in his introductory section al-Khwarizmi uses geometrical figures to explain equations, which surely argues for a familiarity with Book II of Euclid's "Elements".
  Rashed [9] writes that al-Khwarizmi's:-
  ... treatment was very probably inspired by recent knowledge of the "Elements".
  However, Gandz in [6] (see also [23]), argues for a very different view:-
  Euclid's "Elements" in their spirit and letter are entirely unknown to [al-Khwarizmi]. Al-Khwarizmi has neither definitions, nor axioms, nor postulates, nor any demonstration of the Euclidean kind.
  I [EFR] think that it is clear that whether or not al-Khwarizmi had studied Euclid's Elements, he was influenced by other geometrical works. As Parshall writes in [35]:-
  ... because his treatment of practical geometry so closely followed that of the Hebrew text, Mishnat ha Middot, which dated from around 150 AD, the evidence of Semitic ancestry exists.
  Al-Khwarizmi continues his study of algebra in Hisab al-jabr w'al-muqabala by examining how the laws of arithmetic extend to an arithmetic for his algebraic objects. For example he shows how to multiply out expressions such as
  (a+bx)(c+dx)(a + b x) (c + d x)(a+bx)(c+dx)
  although again we should emphasise that al-Khwarizmi uses only words to describe his expressions, and no symbols are used. Rashed [9] sees a remarkable depth and novelty in these calculations by al-Khwarizmi which appear to us, when examined from a modern perspective, as relatively elementary. He writes [9]:-
  Al-Khwarizmi's concept of algebra can now be grasped with greater precision: it concerns the theory of linear and quadratic equations with a single unknown, and the elementary arithmetic of relative binomials and trinomials. ... The solution had to be general and calculable at the same time and in a mathematical fashion, that is, geometrically founded. ... The restriction of degree, as well as that of the number of unsophisticated terms, is instantly explained. From its true emergence, algebra can be seen as a theory of equations solved by means of radicals, and of algebraic calculations on related expressions...
  If this interpretation is correct, then al-Khwarizmi was as Sarton writes:-
  ... the greatest mathematician of the time, and if one takes all the circumstances into account, one of the greatest of all time....
  In a similar vein Rashed writes [9]:-
  It is impossible to overstress the originality of the conception and style of al-Khwarizmi's algebra...
  but a different view is taken by Crossley who writes [4]:-
  [Al-Khwarizmi] may not have been very original...
  and Toomer who writes in [1]:-
  ... Al-Khwarizmi's scientific achievements were at best mediocre.
  In [23] Gandz gives this opinion of al-Khwarizmi's algebra:-
  Al-Khwarizmi's algebra is regarded as the foundation and cornerstone of the sciences. In a sense, al-Khwarizmi is more entitled to be called "the father of algebra" than Diophantus because al-Khwarizmi is the first to teach algebra in an elementary form and for its own sake, Diophantus is primarily concerned with the theory of numbers.
  The next part of al-Khwarizmi's Algebra consists of applications and worked examples. He then goes on to look at rules for finding the area of figures such as the circle and also finding the volume of solids such as the sphere, cone, and pyramid. This section on mensuration certainly has more in common with Hindu and Hebrew texts than it does with any Greek work. The final part of the book deals with the complicated Islamic rules for inheritance but require little from the earlier algebra beyond solving linear equations.
  
  
  Al-Khwarizmi also wrote a treatise on Hindu-Arabic numerals. The Arabic text is lost but a Latin translation, Algoritmi de numero Indorum in English Al-Khwarizmi on the Hindu Art of Reckoning  gave rise to the word algorithm deriving from his name in the title. Unfortunately the Latin translation (translated into English in [19]) is known to be much changed from al-Khwarizmi's original text (of which even the title is unknown). The work describes the Hindu place-value system of numerals based on 1, 2, 3, 4, 5, 6, 7, 8, 9, and 0. The first use of zero as a place holder in positional base notation was probably due to al-Khwarizmi in this work. Methods for arithmetical calculation are given, and a method to find square roots is known to have been in the Arabic original although it is missing from the Latin version. Toomer writes [1]:-
  ... the decimal place-value system was a fairly recent arrival from India and ... al-Khwarizmi's work was the first to expound it systematically. Thus, although elementary, it was of seminal importance.
  Seven twelfth century Latin treatises based on this lost Arabic treatise by al-Khwarizmi on arithmetic are discussed in [17].
  
  
  Another important work by al-Khwarizmi was his work Sindhind zij on astronomy. The work, described in detail in [48], is based in Indian astronomical works [47]:-
  ... as opposed to most later Islamic astronomical handbooks, which utilised the Greek planetary models laid out in Ptolemy's "Almagest" Ⓣ(The major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis') ...
  The Indian text on which al-Khwarizmi based his treatise was one which had been given to the court in Baghdad around 770 as a gift from an Indian political mission. There are two versions of al-Khwarizmi's work which he wrote in Arabic but both are lost. In the tenth century al-Majriti made a critical revision of the shorter version and this was translated into Latin by Adelard of Bath. There is also a Latin version of the longer version and both these Latin works have survived. The main topics covered by al-Khwarizmi in the Sindhind zij are calendars; calculating true positions of the sun, moon and planets, tables of sines and tangents; spherical astronomy; astrological tables; parallax and eclipse calculations; and visibility of the moon. A related manuscript, attributed to al-Khwarizmi, on spherical trigonometry is discussed in [39].
  
  
  Although his astronomical work is based on that of the Indians, and most of the values from which he constructed his tables came from Hindu astronomers, al-Khwarizmi must have been influenced by Ptolemy's work too [1]:-
  It is certain that Ptolemy's tables, in their revision by Theon of Alexandria, were already known to some Islamic astronomers; and it is highly likely that they influenced, directly or through intermediaries, the form in which Al-Khwarizmi's tables were cast.
  Al-Khwarizmi wrote a major work on geography which give latitudes and longitudes for 2402 localities as a basis for a world map. The book, which is based on Ptolemy's Geography, lists with latitudes and longitudes, cities, mountains, seas, islands, geographical regions, and rivers. The manuscript does include maps which on the whole are more accurate than those of Ptolemy. In particular it is clear that where more local knowledge was available to al-Khwarizmi such as the regions of Islam, Africa and the Far East then his work is considerably more accurate than that of Ptolemy, but for Europe al-Khwarizmi seems to have used Ptolemy's data.
  
  
  A number of minor works were written by al-Khwarizmi on topics such as the astrolabe, on which he wrote two works, on the sundial, and on the Jewish calendar. He also wrote a political history containing horoscopes of prominent persons.
  
  
  We have already discussed the varying views of the importance of al-Khwarizmi's algebra which was his most important contribution to mathematics. Let us end this article with a quote by Mohammad Kahn, given in [3]:-
  In the foremost rank of mathematicians of all time stands Al-Khwarizmi. He composed the oldest works on arithmetic and algebra. They were the principal source of mathematical knowledge for centuries to come in the East and the West. The work on arithmetic first introduced the Hindu numbers to Europe, as the very name algorism signifies; and the work on algebra ... gave the name to this important branch of mathematics in the European world...
  
  
  
  
  
  Quotations by Al-Khwarizmi
  
  Other Mathematicians born in Iraq
  
  A Poster of Al-Khwarizmi
  
  
  
  
  
  References (show)
  
  
  
  
  
  G J Toomer, Biography in Dictionary of Scientific Biography (New York 1970-1990).
  
  See THIS LINK.
  Biography in Encyclopaedia Britannica.
  
  http://www.britannica.com/biography/al-Khwarizmi
  A A al'Daffa, The Muslim contribution to mathematics (London, 1978).
  J N Crossley, The emergence of number (Singapore, 1980).
  A F Faizullaev, The scientific heritage of Muhammad al-Khwarizmi (Russian) (Tashkent, 1983).
  S Gandz (ed.), The geometry of al-Khwarizmi (Berlin, 1932).
  E Grant (ed.), A source book in medieval science (Cambridge, 1974).
  O Neugebauer, The exact sciences in Antiquity (New York, 1969).
  R Rashed, The development of Arabic mathematics : between arithmetic and algebra (London, 1994).
  R Rashed, Entre arithmétique et algèbre: Recherches sur l'histoire des mathématiques arabes (Paris, 1984).
  F Rosen (trs.), Muhammad ibn Musa Al-Khwarizmi : Algebra (London, 1831).
  K F Abdulla-Zade, al-Khwarizmi and the Baghdad astronomers (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 178-183.
  M Abdullaev, al-Khwarizmi and scientific thought in Daghestan (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 228-232.
  A Abdurakhmanov, al-Khwarizmi : great mathematician (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 149-151.
  M A Akhadova, The mathematics of India and al-Khwarizmi (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 238-240.
  S al-Khalidi, al-Khwarizmi : scholar of astronomical and mathematical geography (Arabic), in Proceedings of the Seventh Annual Conference on the History of Arabic Science (Arabic) (Aleppo, 1986), 55-63.
  A Allard, La diffusion en occident des premières oeuvres latines issues de l'arithmétique perdue d'al-Khwarizmi, J. Hist. Arabic Sci. 9 (1-2) (1991), 101-105.
  P G Bulgakov, al-Biruni and al-Khwarizmi (Russian), in Mathematics and astronomy in the works of scientists of the medieval East (Tashkent, 1977), 117-122, 140.
  J N Crossley and A S Henry, Thus spake al-Khwarizmi : a translation of the text of Cambridge University Library ms. Ii.vi.5, Historia Math. 17 (2) (1990), 103-131.
  Y Dold-Samplonius, Developments in the solution to the equation cx€ + bx = a from al-Khwarizmi to Fibonacci, in From deferent to equant (New York, 1987), 71-87.
  R Z Du, al-Khwarizmi and his algebraic treatise (Chinese), Math. Practice Theory (1) (1987), 79-85.
  K Fogel, How al-Khwarizmi became known in Germany (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 85-91.
  S Gandz, The sources of al-Khwarizmi's algebra, Osiris, i (1936), 263-77.
  J P Hogendijk, al-Khwarizmi's table of the 'sine of the hours' and the underlying sine table, Historia Sci. 42 (1991), 1-12.
  B B Hughes, Robert of Chester's Latin translation of al-Khwarizmi's 'al-Jabr', Boethius : Texts and Essays on the History of the Exact Sciences XIV (Stuttgart, 1989).
  D K Ibadov, The work of al-Khwarizmi in the estimation of Eastern encyclopedic scholars of the 10th - 16th centuries (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 265-268.
  W Kaunzner, Über eine frühe lateinische Bearbeitung der Algebra al-Khwarizmis in MS Lyell 52 der Bodleian Library Oxford, Arch. Hist. Exact Sci. 32 (1) (1985), 1-16.
  E S Kennedy, Al-Khwarizmi on the Jewish calendar, Scripta Math. 27 (1964), 55-59.
  A S Kennedy and W Ukashah, al-Khwarizmi's planetary latitude tables, Centaurus 14 (1969), 86-96.
  M M Khairullaev, al-Khwarizmi and his era (Russian), Voprosy Istor. Estestvoznan. i Tekhn. (3) (1983), 121-127.
  P Kunitzsch, al-Khwarizmi as a source for the 'Sententie astrolabii', in From deferent to equant (New York, 1987), 227-236.
  G P Matvievskaya, The algebraic treatise of al-Khwarizmi (Russian), in On the history of medieval Eastern mathematics and astronomy (Tashkent, 1983), 3-22.
  G P Matvievskaya, History of the study of the scientific work of al-Khwarizmi (Russian),, in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 72-82.
  C A Nallino, Al'Khuwarizimi e il suo rifacimento della Geografia di Tolomeo, Raccolta di scritti editie inediti V (Rome, 1944), 458-532.
  K H Parshall, The art of algebra from al-Khwarizmi to Viète : a study in the natural selection of ideas, Hist. of Sci. 26 (72, 2) (1988), 129-164.
  M A Pathan, Al-Khwarizmi, Math. Ed. 6 (2) (1989), 92-94.
  D Pingree, al-Khwarizmi in Samaria, Arch. Internat. Hist. Sci. 33 (110) (1983), 15-21.
  B A Rosenfeld, 'Geometric trigonometry' in treatises of al-Khwarizmi, al-Mahani and ibn al-Haytham, in Vestigia mathematica (Amsterdam, 1993), 305-308.
  B A Rozenfeld, al-Khwarizmi's spherical trigonometry (Russian), Istor.-Mat. Issled. 32-33 (1990), 325-339.
  B A Rozenfeld, Number theory, geometry and astronomy in al-Khwarizmi's 'Book of Indian arithmetic' (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 66-72.
  B A Rozenfeld and N D Sergeeva, The astronomical treatises of al-Khwarizmi (Russian), Istor.-Astronom. Issled. 13 (1977), 201-218.
  M M Rozhanskaya, The historical-astronomical value of al-Khwarizmi's 'zij' (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 158-165.
  A S Sadykov, al-Khwarizmi : his era, life and work (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 8-13.
  M Sani, The life and work of al-Khwarizmi, Menemui Mat. 4 (1) (1982), 1-9.
  K S Siddikov, Muhammad al-Khwarizmi : creator of algebra (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 152-154.
  S Kh Sirazhdinov and G P Matvievskaya, Muhammad ibn Musa al-Khwarizmi and his contribution to the history of science (Russian), Voprosy Istor. Estestvoznan. i Tekhn. (1) (1983), 108-119.
  Z K Sokolovskaya, The 'pretelescopic' period of the history of astronomical instruments. al-Khwarizmi in the development of precision instruments in the Near and Middle East (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 165-178.
  B van Dalen, Al'Khwarizmi's astronomical tables revisited : analysis of the equation of time, in From Baghdad to Barcelona (Barcelona, 1996), 195-252.
  K Vogel, Wie wurden al-Khwarizmi s mathematische Schriften in Deutschland bekannt?, Sudhoffs Arch. 68 (2) (1984), 230-234.
  A I Volodarskii, al-Khwarizmi and Indian mathematics (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 232-238.
  E Yu Yusupov and M M Kharullaev, The creative legacy of al-Khwarizmi and his place in the history of science (Russian), Voprosy Filos. (8) (1983), 140-146, 174.
  Kh Zemanek, Manuscripts of al-Khwarizmi's works (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 115-121.
  V K Zharov, Instrumental counting in al-Khwarizmi's arithmetical treatise (Russian), in The great medieval scientist al-Khwarizmi (Tashkent, 1985), 154-157.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other pages about Al-Khwarizmi:
  
  See Al-Khwarizmi on a timeline
  Al-Khwarizmi and quadratic equations
  A facsimile of the frontispiece from Algebra
  A facsimile of another page ...
  ... and a translation
  Miller's postage stamps
  Heinz Klaus Strick biography
  
  
  
  Other websites about Al-Khwarizmi:
  
  Dictionary of Scientific Biography
  Encyclopaedia Britannica
  MathSciNet Author profile
  
  
  
  
  
  
  Honours (show)
  
  
  
  
  Honours awarded to Al-Khwarizmi
  
  Lunar features Crater Al-Khwarizmi
  Popular biographies list Number 11
  
  
  
  
  
  
  Cross-references (show)
  
  
  
  
  
  History Topics: A chronology of pi
  History Topics: A history of Pi
  History Topics: A history of Zero
  History Topics: Arabic mathematics : forgotten brilliance?
  History Topics: Quadratic, cubic and quartic equations
  History Topics: The Arabic numeral system
  History Topics: The Golden ratio
  History Topics: The fundamental theorem of algebra
  History Topics: The history of cartography
  Student Projects: Indian Mathematics - Redressing the balance: Chapter 11
  Other: 2009 Most popular biographies
  Other: Earliest Known Uses of Some of the Words of Mathematics (A)
  Other: Earliest Known Uses of Some of the Words of Mathematics (F)
  Other: Earliest Known Uses of Some of the Words of Mathematics (H)
  Other: Earliest Known Uses of Some of the Words of Mathematics (S)
  Other: Earliest Known Uses of Some of the Words of Mathematics (V)
  Other: Jeff Miller's postage stamps
  Other: Most popular biographies
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update July 1999
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "Y1ymJYIB-iFoJ7CDJpIk",
          "_score": 2.0781758,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Rafael_Bombelli",
            "biography": """
  
  
  Rafael Bombelli
  
  
  
  
  
  Quick Info
  Born
  
        January 1526
        
  
          Bologna, Papal States (now Italy)
          
  
  Died
  
        1572
        
        (probably) Rome, Papal States (now Italy)
      
  
  Summary
  Rafael Bombelli was an Italian mathematician who wrote an influential algebra text and made free use of both negative numbers and complex numbers.
  
  
  
  
  
      View one larger picture
  
  
  
  
  
  Biography
  Rafael Bombelli's father was Antonio Mazzoli but he changed his name from Mazzoli to Bombelli. It is perhaps worth giving a little family background. The Bentivoglio family ruled over Bologna from 1443. Sante Bentivoglio was "signore" (meaning lord) of Bologna from 1443 and he was succeeded by Giovanni II Bentivoglio who improved the city of Bologna, in particular developing its waterways. The Mazzoli family were supporters of the Bentivoglio family but their fortunes changed when Pope Julius II took control of Bologna in 1506, driving the Bentivoglio family into exile. An attempt to regain control in 1508 was defeated and Antonio Mazzoli's grandfather, like several other supporters of the failed Bentivoglio coup, were executed. The Mazzoli family suffered for many years by having their property confiscated, but the property was returned to Antonio Mazzoli, Rafael Bombelli's father.
  
  
  Antonio Mazzoli was able to return to live in Bologna. There he carried on his trade as a wool merchant and married Diamante Scudieri, a tailor's daughter. Rafael Bombelli was their eldest son, and he was one of a family of six children. Rafael received no university education. He was taught by an engineer- architect Pier Francesco Clementi so it is perhaps not too surprising that Bombelli himself should turn to that occupation. Bombelli found himself a patron in Alessandro Rufini who was a Roman noble, later to become the Bishop of Melfi.
  
  
  It is unclear exactly how Bombelli learnt of the leading mathematical works of the day, but of course he lived in the right part of Italy to be involved in the major events surrounding the solution of cubic and quartic equations. Scipione del Ferro, the first to solve the cubic equation was the professor at Bologna, Bombelli's home town, but del Ferro died the year that Bombelli was born. The contest between Fior and Tartaglia (see Tartaglia's biography) took place in 1535 when Bombelli was nine years old, and Cardan's major work on the topic Ars Magna was published in 1545. Clearly Bombelli had studied Cardan's work and he also followed closely the very public arguments between Cardan, Ferrari and Tartaglia which culminated in the contest between Ferrari and Tartaglia in Milan in 1548 (see Ferrari's biography for details).
  
  
  From about 1548 Pier Francesco Clementi, Bombelli's teacher, worked for the Apostolic Camera, a specialised department of the papacy in Rome set up to deal with legal and financial matters. The Apostolic Camera employed Clementi to reclaim marshes near Foligno on the Topino River, southeast of Perugia in central Italy. This region had became part of the Papal States in 1439. It is probable that Bombelli assisted his teacher Clementi with this project, but we have no direct evidence that this was the case. We certainly know that around 1549 Bombelli became interested in another reclamation project in a neighbouring region.
  
  
  It was in 1549 that Alessandro Rufini, Bombelli's patron, acquired the rights to reclaim that part of the marshes of the Val di Chiana which belonged to the Papal States. The Val di Chiana is a fairly central region in the Tuscan Apennines which was not well drained either by the Arno river which runs north west going through Florence and Pisa to the sea, or by the Tiber which runs south through Rome. By 1551 Bombelli was in the Val di Chiana recording the boundaries to the land that was to be reclaimed. He worked on this project until 1555 when there was an interruption to the reclamation work.
  
  
  While Bombelli was waiting for the Val di Chiana project to recommence, he decided to write an algebra book. He had felt that the reason for the many arguments between leading mathematicians was the lack of a careful exposition of the subject. Only Cardan had, in Bombelli's opinion, explored the topic in depth and his great masterpiece was not accessible to people without a thorough grasp of mathematics. Bombelli felt that a self-contained text which could be read by those without a high level of mathematical training would be beneficial. He wrote in the preface of his book [2] (see also [3]):-
  I began by reviewing the majority of those authors who have written on [algebra] up to the present, in order to be able to serve instead of them on the matter, since there are a great many of them.
  By 1557, the work at Val di Chiana still being suspended, Bombelli had begun writing his algebra text. We will study in detail the contents of the work below. Suffice to say for the moment that, in 1560 when work at Val di Chiana recommenced, Bombelli had not completed his algebra book.
  
  
  Work at the Val di Chiana marshes could not have been far from completion when it had been suspended, for it was completed before the end of 1560. The scheme was a great success and through the project Bombelli gained a high reputation as an hydraulic engineer. In 1561 Bombelli went to Rome but failed in an attempt to repair the Santa Maria bridge over the Tiber. However, with reputation still high, Bombelli was taken on as a consultant for a project to drain the Pontine Marshes. These marshes in the Lazio region of south-central Italy had been an area where malaria had been a health hazard since the period of the Roman Republic. Several emperors and popes made unsuccessful attempts to reclaim the area but all, including the one which Bombelli acted as consultant on for Pope Pius IV, came to nothing. [It was not until 1928 that the Pontine Marshes were finally drained.]
  
  
  On one of Bombelli's visits to Rome he made an exciting mathematical discovery. Antonio Maria Pazzi, who taught mathematics at the University of Rome, showed Bombelli a manuscript of Diophantus's Arithmetica and, after Bombelli had examined it, the two men decided to make a translation. Bombelli wrote in [2] (see also [3]):-
  ... [we], in order to enrich the world with a work so finely made, decided to translate it and we have translated five of the books (there being seven in all); the remainder we were not able to finish because of pressure of work on one or other.
  Despite never completing the task, Bombelli began to revise his algebra text in the light of what he had discovered in Diophantus. In particular, 143 of the 272 problems which Bombelli gives in Book III are taken from Diophantus. Bombelli does not identify which problems are his own and which are due to Diophantus, but he does give full credit to Diophantus acknowledging that he has borrowed many of the problems given in his text from the Arithmetica.
  
  
  Bombelli's Algebra was intended to be in five books. The first three were published in 1572 and at the end of the third book he wrote that [1]:-
  ... the geometrical part, Books IV and V, is not yet ready for the publisher, but its publication will follow shortly.
  Unfortunately Bombelli was never able to complete these last two volumes for he died shortly after the publication of the first three volumes. In 1923, however, Bombelli's manuscript was discovered in a library in Bologna by Bortolotti. As well as a manuscript version of the three published books, there was the unfinished manuscript of the other two books. Bortolotti published the incomplete geometrical part of Bombelli's work in 1929. Some results from Bombelli's incomplete Book IV are also described in [17] where author remarks that Bombelli's methods are related to the geometrical procedures of Omar Khayyam.
  
  
  Bombelli's Algebra gives a thorough account of the algebra then known and includes Bombelli's important contribution to complex numbers. Before looking at his remarkable contribution to complex numbers we should remark that Bombelli first wrote down how to calculate with negative numbers. He wrote (see [2] or [3]):-
  Plus times plus makes plus
  
  Minus times minus makes plus
  
  Plus times minus makes minus
  
  Minus times plus makes minus
  
  Plus 8 times plus 8 makes plus 64
  
  Minus 5 times minus 6 makes plus 30
  
  Minus 4 times plus 5 makes minus 20
  
  Plus 5 times minus 4 makes minus 20
  As Crossley notes in [3]:-
  Bombelli is explicitly working with signed numbers. He has no reservations about doing this, even though in the problems he subsequently treats he neglects possible negative solutions.
  In Bombelli's Algebra there is even a geometric proof that minus time minus makes plus; something which causes many people difficulty even today despite our mathematical sophistication.
  
  
  Bombelli, himself, did not find working with complex numbers easy at first, writing in [2] (see also [3]):-
  And although to many this will appear an extravagant thing, because even I held this opinion some time ago, since it appeared to me more sophistic than true, nevertheless I searched hard and found the demonstration, which will be noted below. ... But let the reader apply all his strength of mind, for [otherwise] even he will find himself deceived.
  Bombelli was the first person to write down the rules for addition, subtraction and multiplication of complex numbers. He writes √−n√-n√−n as "plus of minus", −√−n-√-n−√−n as "minus of minus", and gives rules such as (see [2] or [3]):-
  Plus of minus times plus of minus makes minus [+√−n×+√−n=−n+√-n \times  +√-n = -n+√−n×+√−n=−n]
  
  Plus of minus times minus of minus makes plus [+√−n×−√−n=+n+√-n \times  -√-n = +n+√−n×−√−n=+n]
  
  Minus of minus times plus of minus makes plus [−√−n×+√−n=+n-√-n \times  +√-n = +n−√−n×+√−n=+n]
  
  Minus of minus times minus of minus makes minus [−√−n×−√−n=−n-√-n \times  -√-n = -n−√−n×−√−n=−n]
  After giving this description of multiplication of complex numbers, Bombelli went on to give rules for adding and subtracting them.
  
  
  He then showed that, using his calculus of complex numbers, correct real solutions could be obtained from the Cardan-Tartaglia formula for the solution to a cubic even when the formula gave an expression involving the square roots of negative numbers.
  
  
  
  Finally we should make some comments on Bombelli's notation. Although authors such as Pacioli had made limited use of notation, others such as Cardan had used no symbols at all. Bombelli, however, used quite sophisticated notation. It is worth remarking that the printed version of his book uses a slightly different notation from his manuscript, and this is not really surprising for there were problems printing mathematical notation which to some extent limited the type of notation which could be used in print.
  
  
  
  Here are some examples of Bombelli's notation. 
  
  Despite the delay in publication, Bombelli's Algebra was a very influential work and led to Leibniz praising Bombelli saying he was an:- 
  ... outstanding master of the analytical art.
  Jayawardene writes in [1] that in his treatment of complex numbers Bombelli:-
  ... showed himself to be far ahead of his time, for his treatment was almost that followed today.
  Crossley writes in [3]:-
  Thus we have an engineer, Bombelli, making practical use of complex numbers perhaps because they gave him useful results, while Cardan found the square roots of negative numbers useless. Bombelli is the first to give a treatment of any complex numbers... It is remarkable how thorough he is in his presentation of the laws of calculation of complex numbers...
  It seems to be quite fair to describe Bombelli as the inventor of complex numbers. Nobody before him had given rules for working with such numbers, nor had they suggested that working with such numbers might prove useful. Dieudonné does not appear to agree with this assessment, however, for in his review of [5] and [6], he writes:-
  ... imaginaries had been used long before Bombelli's book, and it is therefore not quite justified to call him the "first discoverer" of complex numbers.
  I [EFR] feel that Dieudonné is wrong here as I believe he is when he writes that Bombelli's Algebra
  ... did not sell very well, nor apparently did it have much influence on later developments.
   I think that Bombelli's Algebra is one of the most remarkable achievements of 16th  century mathematics, and he must be credited with understanding the importance of complex numbers at a time when clearly nobody else did.
  
  
  
  
  
  Other Mathematicians born in Italy
  
  A Poster of Rafael Bombelli
  
  
  
  
  
  References (show)
  
  
  
  
  
  S A Jayawardene, Biography in Dictionary of Scientific Biography (New York 1970-1990).
  
  See THIS LINK.
  E Bortolotti (ed.), R Bombelli L'Algebra, Books I-V (Milan, 1966).
  J N Crossley, The emergence of number (Singapore, 1980).
  E Giusti, Algebra and geometry in Bombelli and Viète, Boll. Storia Sci. Mat. 12 (2) (1992), 303-328.
  J E Hofmann, R Bombelli - Erstentdecker des Imaginären. II, Praxis Math. 14 (10) (1972), 251-254.
  J E Hofmann, R Bombelli - Erstentdecker des Imaginären, Praxis Math. 14 (9) (1972), 225-230.
  J E Hofmann, Bombellis 'Algebra' - eine genialische Einzelleistung und ihre Einwirkung auf Leibniz, Studia Leibnitiana 4 (3-4) (1972), 196-252.
  S A Jayawardene, Unpublished Documents Relating to Rafael Bombelli in the Archives of Bologna, Isis 54 (1963), 391-395.
  S A Jayawardene, Rafael Bombelli, Engineer- Architect: Some Unpublished Documents of the Apostolic Camera, Isis 56 (1965), 298-306.
  S A Jayawardene, The influence of practical arithmetics on the 'Algebra' of Rafael Bombelli, Isis 64 (224) (1973), 510-523.
  S A Jayawardene, Documenti inediti negli archivi di Bologna intorno a Raffaele Bombelli e la sua famiglia, Atti Accad. Sci. Ist. Bologna Cl. Sci. Fis. Rend. (11) 10 (2) (1962/1963), 235-247.
  A P Kaucikas, Indeterminate equations in R. Bombelli's 'Algebra' (Russian), in History and methodology of the natural sciences XX (Moscow, 1978), 138-146.
  S Maracchia, Estrazione della radice quadrata secondo Bombelli (Italian), Archimede 28 (3) (1976), 180-182.
  K Reich, Diophant, Cardano, Bombelli, Viète : Ein Vergleich ihrer Aufgaben, Festschrift für Kurt Vogel (Munich, 1968), 131-150.
  P L Rose, The Italian Renaissance of Mathematics (Geneva, 1975), 146-148.
  M T Rivolo and A Simi, The computation of square and cube roots in Italy from Fibonacci to Bombelli (Italian), Arch. Hist. Exact Sci. 52 (2) (1998), 161-193.
  G S Smirnova, Geometric solution of the cubic equations in Raffaele Bombelli's 'Algebra' (Russian), Istor. Metodol. Estestv. Nauk 36 (1989), 123-129.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other pages about Rafael Bombelli:
  
  Bombelli's Algebra
  The title page from L'Algebre (1579)
  ... and another page
  
  
  
  Other websites about Rafael Bombelli:
  
  Dictionary of Scientific Biography
  The Galileo Project
  
  
  
  
  
  
  Honours (show)
  
  
  
  
  Honours awarded to Rafael Bombelli
  
  Lunar features Crater Bombelli
  
  
  
  
  
  
  Cross-references (show)
  
  
  
  
  
  History Topics: Mathematics and Architecture
  History Topics: Quadratic, cubic and quartic equations
  History Topics: The Golden ratio
  History Topics: The fundamental theorem of algebra
  Other: Earliest Known Uses of Some of the Words of Mathematics (L)
  Other: Earliest Uses of Grouping Symbols
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update January 2000
    
  
  
  """
          }
        },
        {
          "_index": "mathematicians",
          "_id": "AlymJYIB-iFoJ7CDEpDt",
          "_score": 2.0603216,
          "_ignored": [
            "biography.keyword"
          ],
          "_source": {
            "name": "Heinrich_Martin_Georg_Friedrich_Weber",
            "biography": """
  
  
  Heinrich Martin Georg Friedrich Weber
  
  
  
  
  
  Quick Info
  Born
  
        5 March 1842
        
  
          Heidelberg, Germany
          
  
  Died
  
        17 May 1913
        
        Strasbourg, Germany (now France)
      
  
  Summary
  Heinrich Weber was a German mathematician whose main work was in algebra, number theory, analysis and applications of analysis to mathematical physics.
  
  
  
  
  
      View four larger pictures
  
  
  
  
  
  Biography
  Heinrich Weber was born in Heidelberg, the son of Georg Weber (1808-1888) who was an historian, author of History of the World, and principal of a high school. Georg Weber had been born in the Rhine Palatinate town of Bergzabern, which was at this time under French rule, and studied at Speyer and the University of Erlangen before being awarded a doctorate from the University of Heidelberg in 1832 for his dissertation De Gytheo et rebus navalibus Lacedaemoniorum Ⓣ(On Gytheio and the  Spartan navy). He married Ida Helene Marie Wilhelmine Becher (died 1887) in 1839 and Heinrich was their eldest son. Heinrich's love of mathematics began while he was at the Lyceum in Heidelberg. There he was taught by Arthur Arneth (1802-1858) who was professor of mathematics and physics at the Lyceum and also a privatdozent at the University of Heidelberg. Arneth wrote the important book History of Pure Mathematics in its Relation to the History of the Development of the Human Mind (1852). The Weber family were very involved in education and they strongly encouraged Heinrich to think in terms of an academic career from a young age. The influence of Weber's family was particularly strong since he lived at home throughout his school and university studies in Heidelberg.
  
  
  After graduating from the Lyceum, Weber entered the University of Heidelberg in 1860 to study mathematics and physics. At this time Heidelberg had some outstanding physicists and mathematicians on the staff who gave courses that Weber attended. These included Gustav Kirchhoff (appointed to Heidelberg in 1854), Robert Bunsen (appointed to Heidelberg in 1852), Hermann von Helmholtz (appointed to Heidelberg in 1858), Otto Hesse (appointed to Heidelberg in 1856), and Moritz Cantor (appointed to Heidelberg in 1853). As was the common practice of German students at this time, Weber spent part of his time studying at a different university. He chose the University of Leipzig in the middle of his studies, spending a semester there in 1862 before returning to Heidelberg to complete his education. He was awarded a doctorate from the University of Heidelberg on 19 February 1863 having been advised by Otto Hesse. He was not required to write a thesis.
  
  
  In order to become a university teacher, Weber needed to write a further thesis, his habilitation thesis. He went to Königsberg where he studied under Franz Neumann and Friedrich Julius Richelot, who had been a student of Jacobi. Although Jacobi had died over ten years before Weber began his studies at Königsberg, his influence was still strongly felt and it would not be unreasonable to say that Weber, through his teachers at Königsberg, was strongly influenced by Jacobi's style of mathematics. In [15] Peter Roquette examines why Weber went to Königsberg for his postgraduate study and notes that three of his teachers at Heidelberg, Hesse, Kirchhoff and Helmholtz, came from Königsberg:-
  ... academic life in Heidelberg around 1863, as far as mathematics and the neighbouring sciences were concerned, was flourishing, and that it was largely dominated by people who came from Königsberg. They knew the stimulating and challenging atmosphere which Königsberg offered to young mathematicians at that time. So it seems natural that young Weber, when he asked his academic teachers where he should go for his postdoctoral studies, was advised to move to Königsberg.
  There were other students at Königsberg at this time who would become important in the development of mathematics, in particular Albert Wangerin, who studied for his doctorate around the same time as Weber worked for his habilitation, and former students such as Albert Clebsch whose influence was still being felt. In fact Weber mentions the names of nine of his fellow students at Königsberg who went on to high profile careers as scientists.
  
  
  On 11 August 1866 Weber's habilitation thesis Singuläre Auflösungen partieller Differentialgleichungen erster Ordnung Ⓣ(Singular resolutions of partial differential equations of first order) was accepted and he became a privatdozent at Heidelberg in that year. His habilitation thesis was published in Volume 66 of Crelle's journal. Three years later, on 20 July 1869, he was appointed as extraordinary professor at Heidelberg but later in the same year he accepted an appointment as a full professor at the Eidgenössische Technische Hochschule in Zürich. He married Emilie Dittenberger in 1870 in Zürich. Emilie was the daughter of a chaplain to the Weimar court. Heinrich and Emilie Weber had seven children, three of whom died young. A daughter, Emilie Weber, gained fame as the translator from French into German of Henri Poincaré's philosophical writings. Her translations were published in 1906 and she died in 1911. A son, Rudolph Heinrich Georg Weber, born 16 August 1874 in Zürich, went on to study mathematics and physics. Rudolph was appointed to the University of Heidelberg in 1902 but spent most of his career as professor of mathematical physics at the University of Rostock. Rudolph sometimes collaborated with his father and we mention in particular a joint publication on Gauss's work on fluids. Over the next twenty-five years, Heinrich Weber taught at a surprising number of different institutions. As well as teaching in Zürich at the Eidgenössische Polytechnikum, he also taught at the University of Königsberg from 1875 to 1883 having been appointed as Richelot's successor - Richelot, born in 1808, died in 1875.
  
  
  Together with Richard Dedekind, Weber had been editing Riemann's Collected works and this important book was published in 1876. However, one of the most significant things to happen during his time teaching at Königsberg was in 1880 when two young students, David Hilbert and Hermann Minkowski, enrolled there. At this time Weber was lecturing on number theory, also gave a course on elliptic functions, and ran a seminar on the theory of invariants. All of these courses were attended by the young Hilbert (and probably also by Minkowski). The lecture notes from one of these courses has been preserved, the course on number theory, and Roquette gives an indication of the contents in [15]:-
  Weber's course started from the very beginning of number theory, working through congruence calculus, continued fractions, towards quadratic reciprocity. After that, binary quadratic forms are discussed, their classes, their composition, and the analytic class number formulas. Also, the existence of primes in arithmetic progressions, using L-series, is included. In this last part the reader gets the impression that things went quite fast but the proofs are recorded in detail. We conclude that much of the concept of the lecture was based on Gauss's 'Disquisitiones' and Dirichlet's papers. In addition Weber was quite explicit in making use of modern notions, for instance the abstract notion of a group is to be found, as well as what we now call the "main theorem on finite abelian groups", i.e., decomposition of finite abelian groups into cyclic factors (in the context of description of characters).
  After leaving Königsberg in 1883, Weber was appointed to the Technische Hochschule in Charlottenburg where he spent only one year before he moved again to the Philipps University of Marburg where he was rector of the university during session 1890-91. His next move, in 1892, was to the Georg-August University of Göttingen where he spent three years. His successor at Göttingen was Hilbert. While at Göttingen he published Die allgemeinen Grundlagen der Galois'schen Gleichungstheorie which is the first paper to contain a discussion of an abstract group, either finite or infinite. Weber's final post was to Strasbourg where he was appointed in 1895. It is reasonable to consider why Weber left Göttingen, perhaps the leading mathematical centre in the world at this time, to move to Strasbourg.
  
  
  Germany had captured Strasbourg after a 50-day siege during the Franco-Prussian war of 1870-71 and annexed the city. After taking control of Alsace-Lorraine, the Germans had reorganised the University of Strasbourg and reopened it as the German Kaiser-Wilhelm University of Strasbourg in 1872. Two mathematics chairs were founded at this time, the first in Mathematics which was filled by Elwin Christoffel and the second in Geometry and Mechanics which was filled by Theodor Reye. Both Christoffel and Reye considered it their patriotic duty to assist in making the University of Strasbourg a German university. Christoffel had been forced to stop teaching in 1892 due to health problems and in 1894 retired leaving the chair vacant. However, Weber did not move to Strasbourg for mathematical reasons, but rather for personal ones. Strasbourg was quite close to Weber's native city of Heidelberg, and one of Weber's daughters, Lina Weber-Holtzmann, had married Heinrich Holtzmann, the professor of theology at Strasbourg, and was living there. Another reason was that his salary was higher in Strasbourg than Göttingen, at least in part because taxes in Alsace were significantly less than those in Prussia. Once he had arrived in Strasbourg he had as colleagues Theodor Reye and the extraordinary professor Adolph Krazer (1858-1926), a student of Friedrich Emil Prym (1841-1919).
  
  
  Again Weber served as rector of the university in which he was working, taking on this role at Strasbourg during session 1900-01. Note that Weber served as rector three times during his career at three different universities. Weber remained in Strasbourg for the rest of his life and during this time it remained a German city; only at the end of the World War I in 1918 did the city revert to France. Of course, the reader of this biography will have noted the large number of different universities at which Weber worked. In fact he holds the record for the largest number of different university posts by any 19th  century German mathematician.
  
  
  Weber's main work was in algebra, number theory, analysis and applications of analysis to mathematical physics. This seems a contradiction in terms, for we have now almost said that Weber's main work spans the whole spectrum of mathematics. In fact this is not far from the truth for Weber's work was characterised by its breadth across a wide range of topics. To a certain extent this breadth can be attributed to the various influences on Weber from colleagues around him. The applications to mathematical physics certainly grew from working with Franz Neumann in Königsberg. But in Königsberg there was also the Jacobi influence, particularly coming through one of his other teachers Friedrich Richelot, which saw Weber doing important work on algebraic functions.
  
  
  Perhaps Weber is today remembered for his outstanding text Lehrbuch der Algebra Ⓣ(Textbook of algebra) published in 1895 and it is for his work in algebra and number theory that he is best known. If he was influenced by his colleagues to work in different areas of mathematics then it is a very fair question to ask where the influence came from which prompted Weber to work on algebra and number theory. The answer must be Dedekind. He wrote an important paper with Dedekind, Theorie der algebraischen Funktionen einer Veränderlichen Ⓣ(Theory of algebraic functions of one variable), published in 1882 in Crelle's journal, in which they examined algebraic functions from an algebraic rather than analytic point of view. In this paper [16]:-
  ... the notion of point on an abstract algebraic curve is defined for the first time in history, thus taking a decisive step towards the creation of modern algebraic geometry.
  The third volume of Lehrbuch der Algebra Ⓣ(Textbook of algebra), published in 1903, was dedicated by Weber to Dedekind, Hilbert and Minkowski:-
  ... the three men to whom I feel closest in scientific respect.
  Weber's Lehrbuch der Algebra Ⓣ(Textbook of algebra) is an outstanding work but, although he tried hard to connect the various algebraic theories, even fundamental concepts such as a field and a group are only seen as tools and not properly developed as theories in their own right. It was, however, a remarkable book which was effective over many years as a teaching tool. James Pierpont writes in a review [13]:-
  A classic from the day of its publication, it is destined to a long and useful career, a monument of honour to its genial author.
  G A Miller wrote in 1913 [11]:-
  Among the advanced text-books on algebra there is probably none which is more favourably known than Weber's "Lehrbuch der Algebra" in three large volumes.
  For longer extracts from these reviews THIS LINK.
  
  
  Norbert Schappacher writes 100 years after the book was published:-
  [T]his work marks the transition from the late 19th  century treatment of algebra to the "modern algebra" whose first full-fledged textbook treatment was going to be van der Waerden's well-known treatise of 1930-31. The third volume would not be called algebra today. It ... contains a classical treatment of elliptic functions, especially their arithmetic theory, along with parts of algebraic number theory and class field theory, as well as a small chapter on differentials of curves in the higher rank case including Riemann-Roch.
  This third volume of Lehrbuch der Algebra Ⓣ(Textbook of algebra) was built on three papers he had written on class field theory entitled Über Zahlengruppen in algebraischen Zahlkörpern Ⓣ(On groups of numbers in algebraic number fields) (1897-98). In these [16]:- 
  ... he emphasized the decomposition behaviour, as opposed to Hilbert's chief interest in the unramifiedness of the (Hilbert) class field.
  Among other books by Weber we mention Die Partiellen Differentialgleichungen der Mathematischen Physik Ⓣ(The partial differential equations of mathematical physics) and (with Josef Wellstein) Encyklopädie der Elementar-Mathematik Ⓣ(Encyclopedia of elementary mathematics).
  
  
  Again extracts from reviews of these books are given at THIS LINK
  
  
  Bruno Schoeneberg, in [1], comments on Weber as a teacher:-
  Weber was an enthusiastic and inspiring teacher who took great interest in educational questions.
  Voss writes of Weber's character in [21]:-
  On closer contact he opened up without reservation to his friends whom he found through scientific cooperation and common interests.
  Towards the end of Weber's life a number of tragedies affected him deeply. His wife Emilie died in 1901 and one of his daughters then looked after the household. However, this daughter died in 1909.
  
  
  Weber received many honours including the publication of a Festschrift compiled by his friends and colleagues to celebrate his 70th  birthday on 5 March 1912. He received an honorary doctorate from the University of Kristiana in 1902 at the time of Abel's centenary celebrations. He received an honorary doctorate from the University of Heidelberg in 1912. He was elected to the Göttingen Academy of Sciences (1875), the Berlin Academy of Science (1896), the Munich Academy of Sciences (1903), the Royal Swedish Academy of Sciences, the Uppsala Academy of Sciences, and the Accademia dei Lincei. He was elected president of the German Mathematical Society twice, in 1895 and again in 1904. He was also President of the International Congress of Mathematicians held in Heidelberg in 1904. From 1893 he served as an editor of the Mathematische Annalen.
  
  
  
  
  
  Other Mathematicians born in Germany
  
  A Poster of Heinrich Weber
  
  
  
  
  
  References (show)
  
  
  
  
  
  B Schoeneberg, Biography in Dictionary of Scientific Biography (New York 1970-1990). See THIS LINK.
  Festschrift Heinrich Weber zu seinem siebzigsten Geburtstag am 5. März 1912 (New York, 1971).
  J S Ames, Review: Die Partiellen Differentialgleichungen der Mathematischen Physik (4th edition), by H Weber, Bull. Amer. Math. Soc. 8 (2) (1901), 81-85.
  R C Archibald, Review: Festschrift Heinrich Weber zu seinem siebzigsten Geburtstag am 5 März 1912, Bull. Amer. Math. Soc. 20 (3) (1913), 152-155.
  T A A B, Review: Encyklopädie der Elementar-Mathematik. Vol 1. Arithmetik, Algebra und Analysis (5th edition), by Heinrich Weber, Josef Wellstein and Paul Epstein, The Mathematical Gazette 19 (233) (1935), 159-160.
  Editors, Review: Encyklopädie der Elementar-Mathematik, Angewandte Elementar-Mathematik Vol 3, by Heinrich Weber and Josef Wellstein, The Mathematical Gazette 4 (67) (1907), 163.
  G Frei, Heinrich Weber and the emergence of class field theory, in Rowe and McCleary, The history of modern mathematics I (Academic Press, Boston, MA, 1989), 425-450.
  Heinrich Weber (1842-1913), in Dietrich Rauschning and Donata v Nerée, Die Albertus-Universität zu Königsberg und ihre Professoren, aus Anlass der Gründung der Albertus-Universität vor 450 Jahren (Duncker & Humblot, Berlin), 509-520.
  O D Kellog, Review: Die Partiellen Differentialgleichungen der Mathematischen Physik (5th edition), by H Weber, Bull. Amer. Math. Soc. 18 (2) (1911), 87-89.
  G B Mathews, Review: Die Partiellen Differentialgleichungen der Mathematischen Physik (4th edition), Vol 1, by Heinrich Weber, The Mathematical Gazette 2 (27) (1901), 51-52.
  G A Miller, Review: Lehrbuch der Algebra. Kleine Ausgabe in einem Bande, by Heinrich Weber, Science, New Series 38 (981) (1913), 550-551.
  F W Owens, Review: Encyklopädie der Elementar-Mathematik, by H Weber and J Wellstein, Bull. Amer. Math. Soc. 17 (10) (1911), 546.
  J Pierpont, Review: Lehrbuch der Algebra, by H Weber, Bull. Amer. Math. Soc. 4 (5) (1898), 200-234.
  J Pierpont, Review: Lehrbuch der Algebra (2nd edition), by H Weber, Bull. Amer. Math. Soc. 5 (10) (1899), 480-482.
  P Roquette, Heinrich Weber, David Hilbert and Königsberg, Hilbert Seminar, State University of Kaliningrad, Svedlogorsk (1 June 1992).
  N Schappacher, On the History of Hilbert's Twelfth Problem: A Comedy of Errors, Matériaux pour l'histoire des mathématiques au XXe siècle, Nice, 1996, Sémin. Congr. 3 (Société Mathématique de France, Paris, 1998), 243-273.
  N Schappacher and K Volkert, Heinrich Weber: un mathématicien à Strasbourg, 1895-1913, in Sciences et cultures - Les trois universités de Strasbourg 1872-1945 (1998).
  J B Shaw, Review: Encyklopädie der Elementar-Mathematik. Angewandte Elementar-Mathematik. (1st part, Vol 3) (2nd edition), by Heinrich Weber and Josef Wellstein, Bull. Amer. Math. Soc. 19 (2) (1912), 87-88.
  J B Shaw, Review: Encyklopädie der Elementar-Mathematik. Angewandte Elementar-Mathematik. (2nd part, Vol 3) (2nd edition), by Heinrich Weber and Josef Wellstein, Bull. Amer. Math. Soc. 19 (8) (1913), 422-423.
  D E Smith, Review: Encyklopädie der Elementar-Mathematik Vol 1, by H Weber and J Wellstein, Bull. Amer. Math. Soc. 10 (4) (1904), 200-204.
  A Voss, Heinrich Weber, Jahresberichte der Deutschen Mathematiker-Vereinigung 23 (1914), 431-444.
  H S White, Review: Encyklopädie der Elementar-Mathematik Vol 2 and Vol3, by H Weber and J Wellstein, Bull. Amer. Math. Soc. 14 (10) (1908), 499-501.
  J W Young, Review: Encyklopädie der Elementar-Mathematik. Vol 1. Arithmetik, Algebra und Analysis (4th edition), by Heinrich Weber, Josef Wellstein and Paul Epstein, Bull. Amer. Math. Soc. 29 (10) (1923), 480.
  
  
  
  
  
  
  Additional Resources (show)
  
  
  
  
  Other pages about Heinrich Weber:
  
  Reviews of Heinrich Weber's books
  
  
  
  Other websites about Heinrich Weber:
  
  Dictionary of Scientific Biography
  University of Heidelberg (In German)
  Mathematical Genealogy Project
  zbMATH entry
  ERAM Jahrbuch entry
  
  
  
  
  
  
  Cross-references (show)
  
  
  
  
  
  History Topics: The abstract group concept
  History Topics: The development of Ring Theory
  History Topics: The development of group theory
  Societies: German Mathematical Society
  Societies: Göttingen Mathematical Society
  Societies: Zurich Scientific Research Society
  Student Projects: The development of Galois theory: Chapter 4
  Other: 1897 ICM - Zurich
  Other: 1904 ICM - Heidelberg
  Other: 1932 ICM - Zurich
  Other: Earliest Known Uses of Some of the Words of Mathematics (A)
  Other: Earliest Known Uses of Some of the Words of Mathematics (E)
  Other: Earliest Known Uses of Some of the Words of Mathematics (F)
  Other: Earliest Known Uses of Some of the Words of Mathematics (G)
  Other: Earliest Known Uses of Some of the Words of Mathematics (N)
  
  
  
  
  
  
      Written by J J O'Connor and E F Robertson
  
      Last Update July 2014
    
  
  
  """
          }
        }
      ]
    }
  }